{
  "backend/main.mo": "Main Motoko actor defining all persistent state (users, posts, reactions, comments, flags, direct messages, invite codes) and their associated types for a pseudonymous emotional support platform with access control, invite links, and crisis detection.",
  "backend/migration.mo": "Stub migration module with empty old/new actor types and a no-op run function for canister upgrades.",
  "feature_evidence.json": "Empty feature evidence report JSON with no features listed.",
  "frontend-file-summaries.txt": "Pre-generated JSON summaries of all frontend source files describing their purpose, fixes, and design decisions.",
  "frontend/index.css": "Tailwind base CSS defining OKLCH-based design tokens for light and dark themes including colors, borders, sidebar, and chart variables.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app at the root div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root React app component setting up TanStack Router with all page routes, React Query client, theme provider, and toast notifications.",
  "frontend/src/components/AdminAllUsersTab.tsx": "Admin tab component listing all users with actions to suspend, unsuspend, apply cooldown, or remove each user via confirmation dialogs.",
  "frontend/src/components/AdminCrisisRiskTab.tsx": "Admin tab displaying posts flagged for crisis risk, with actions to remove the post, send a check-in message, or send crisis resources to the author.",
  "frontend/src/components/AdminDashboard.tsx": "Main admin dashboard component with tabbed navigation covering public posts, user management, invite codes, flagged content, emotional alerts, and crisis risk. Includes an ecosystem silence banner that lets admins publish a prompt post when no public posts have been made in 5 days.",
  "frontend/src/components/AdminEmotionalAlertsTab.tsx": "Displays a list of users flagged for posting 5 or more 'Broke' entries within 3 consecutive days, showing their pseudonym and post count.",
  "frontend/src/components/AdminFlaggedComments.tsx": "Lists flagged comments with author pseudonym, timestamp, and associated post ID, allowing admins to permanently remove them via a confirmation dialog.",
  "frontend/src/components/AdminFlaggedPosts.tsx": "Lists flagged posts with report counts and post content, allowing admins to permanently remove them via a confirmation dialog.",
  "frontend/src/components/AdminInviteCodes.tsx": "Manages invite codes by allowing admins to generate new codes, copy invite links to clipboard, and revoke unused codes.",
  "frontend/src/components/AdminPublicPostsList.tsx": "Displays all public posts sorted by date with emotion badges, and allows admins to remove individual posts via a confirmation dialog.",
  "frontend/src/components/AdminRoute.tsx": "Route guard component that redirects unauthenticated users to login and shows an access-denied screen for non-admin roles, rendering children only for authenticated admins.",
  "frontend/src/components/AdminSignup.tsx": "Form component that allows an admin to create a new member account by generating an invite code and registering a pseudonym and region.",
  "frontend/src/components/AdminUserManagement.tsx": "Admin panel component that lists all users with their profiles and allows updating each user's subscription status via a dropdown.",
  "frontend/src/components/AdminUserPostHistory.tsx": "Admin tool that searches for a user's posts by principal ID and allows viewing and deleting individual posts.",
  "frontend/src/components/EmotionBadge.tsx": "Renders a styled pill badge for a given EmotionType (happy, confess, broke) using CSS variable-based color theming.",
  "frontend/src/components/EntryProtectionModal.tsx": "Non-dismissible modal dialog shown on entry that displays a privacy/safety disclaimer and requires the user to acknowledge it before proceeding.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying the copyright year and a branded link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with links to Write, Archive, Community, and Admin pages for authenticated users, and Sign in/Join for unauthenticated users.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper that composes the Header, Footer, and a router Outlet for page content.",
  "frontend/src/components/PostCard.tsx": "Displays a single user post with its emotion badge, visibility status, date, content, and a toggle button to switch between private and public visibility.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to the login page and shows a spinner while auth state is initializing.",
  "frontend/src/components/PublicPostCard.tsx": "Community feed card for a public post that supports text reactions, comments, and flagging, with controls hidden for the post's own author.",
  "frontend/src/components/PublicPostWarningModal.tsx": "A non-dismissible modal dialog that warns users about the visibility of public posts and requires explicit acknowledgment via an 'I understand' button.",
  "frontend/src/components/SubscriptionBanner.tsx": "A banner component that displays a subscription expiry notice with region-specific pricing (India or global).",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAuth.ts": "A hook that exposes authentication state (isAuthenticated, userId, role) and a logout function by combining Internet Identity and admin-check queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity login, logout, and identity state via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profiles, posts, comments, reactions, registration, and admin operations.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/component/utility layers, CSS custom properties for light/dark themes with calm OKLCH color tokens, and typography using Lora and Inter fonts.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "A protected admin page that redirects unauthenticated or non-admin users and renders the AdminDashboard component for authorized admins.",
  "frontend/src/pages/CommunityFeedPage.tsx": "A protected page that displays a chronological list of public posts using PublicPostCard components, with loading skeletons and an empty state.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page where authenticated users can create posts by selecting an emotion type, writing content, and toggling public/private visibility, with modals for entry acknowledgment and public post warnings.",
  "frontend/src/pages/LoginPage.tsx": "Login page that authenticates users via Internet Identity and redirects to the community page on success, with a link to the signup page.",
  "frontend/src/pages/MyPostsPage.tsx": "Page displaying all of the authenticated user's posts sorted by date, with visibility counts, empty state, and a button to create a new post.",
  "frontend/src/pages/PostCreationPage.tsx": "Dedicated post creation page with emotion selection, content input with word count enforcement, public/private toggle, and modals for entry and public post acknowledgment, redirecting to posts list after submission.",
  "frontend/src/pages/SignupPage.tsx": "Registration page that collects a pseudonym, region, and invite code to create a new user account, showing remaining seat availability.",
  "frontend/src/utils/cookies.ts": "Utility functions for setting, getting, and clearing a client-side auth token cookie with Secure and SameSite=Strict attributes.",
  "frontend/src/utils/subscriptionHelpers.ts": "Helper functions to check subscription status (active/grace), determine post creation and public posting permissions, and return regional pricing and status labels.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL query parameters from both regular and hash-based routing, persisting them in sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/src/utils/wordCounter.ts": "Provides utilities for counting words in a string and checking if text meets a minimum word count (24 words), with a helper to determine which emotion types require the minimum.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, emotion-mode color tokens, border radii, box shadows, and plugins for animations, typography, and container queries.",
  "project_state.json": "Tracks the VEIL app's project state including architectural principles, known issues, and a list of MVP feature requests (AR-1 through AR-16+) covering registration, login, post creation, feed, reactions, flagging, and admin panel."
}