{
  "backend/main.mo": "Main actor for the Veil backend defining persistent state (users, posts, reactions, comments, flags, invite codes), all data types, and business logic including user registration, post creation, admin moderation, and emotional monitoring.",
  "backend/migration.mo": "Migration module that defines old and new actor/user shapes and provides a `run` function to carry forward user data unchanged between canister upgrades.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (admin user management tab, flagged posts removal, emotional monitoring alerts, and new admin query/mutation hooks) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON document containing one-to-two sentence summaries of every frontend source file, used as a build-planning reference for the project.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH-based CSS custom property design tokens for light and dark themes including colors, borders, charts, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the Veil React SPA, mounting the app into a `#root` div and loading the TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes (login, signup, dashboard, create, posts, community, admin), wraps the app in QueryClientProvider and ThemeProvider, and renders a global Toaster.",
  "frontend/src/components/AdminAllUsersTab.tsx": "Admin tab component that lists all registered users with pseudonym, region, subscription status, and suspension state, providing per-row action buttons for suspend/unsuspend, 24-hour cooldown, and permanent removal with confirmation dialogs.",
  "frontend/src/components/AdminDashboard.tsx": "Main admin panel component with tabbed navigation covering posts, users, invite codes, flagged content, and emotional alerts. Displays seat usage stats and an alert banner when emotional monitoring thresholds are exceeded.",
  "frontend/src/components/AdminEmotionalAlertsTab.tsx": "Tab component that lists users flagged for posting 5+ BROKE posts within 3 days, showing their pseudonym, count, and date window. Provides informational guidance to admins without taking automated action.",
  "frontend/src/components/AdminFlaggedComments.tsx": "Admin tab that displays flagged comments with author pseudonym resolution and allows admins to delete individual comments via a confirmation dialog.",
  "frontend/src/components/AdminFlaggedPosts.tsx": "Admin tab that groups flagged posts by post ID, shows report counts, and allows admins to permanently remove posts via a confirmation dialog with toast notifications.",
  "frontend/src/components/AdminInviteCodes.tsx": "Admin tab for managing invite codes, supporting adding custom codes, generating random ones, revoking existing codes, and copying shareable signup links with a clipboard confirmation state.",
  "frontend/src/components/AdminPublicPostsList.tsx": "Displays a paginated, sortable list of all posts for admins with visibility/emotion badges and a confirmation dialog for deleting individual posts.",
  "frontend/src/components/AdminRoute.tsx": "Route guard component that redirects unauthenticated users to login and shows an access-denied screen for non-admin roles.",
  "frontend/src/components/AdminSignup.tsx": "Admin form that auto-generates an invite code and registers a new user account with a pseudonym and region selection.",
  "frontend/src/components/AdminUserManagement.tsx": "Lists all users in an accordion UI, allowing admins to suspend/unsuspend accounts and change subscription status per user.",
  "frontend/src/components/AdminUserPostHistory.tsx": "Lets admins search posts by a user's Principal ID and displays results with options to delete individual posts.",
  "frontend/src/components/EmotionBadge.tsx": "Renders a styled badge pill for a given EmotionType (confess, broke, happy) using predefined color configurations.",
  "frontend/src/components/EntryProtectionModal.tsx": "A non-dismissible modal dialog that requires users to explicitly acknowledge the app's safe-space guidelines before proceeding.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying the copyright year and a branded link to caffeine.ai with the app's hostname as a UTM parameter.",
  "frontend/src/components/Header.tsx": "Sticky navigation header displaying the Veil logo, nav links (including admin if applicable), user pseudonym, and a sign-out button based on authentication state.",
  "frontend/src/components/Layout.tsx": "Simple layout wrapper that composes Header, main content area, and Footer into a full-height flex column.",
  "frontend/src/components/PostCard.tsx": "Card component for displaying a user's own post with emotion badge, visibility status, word count, and actions to delete or toggle public/private visibility.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard that redirects unauthenticated users to /login and shows a spinner while the auth state is initializing.",
  "frontend/src/components/PublicPostCard.tsx": "Card component for community feed posts supporting text reactions, threaded comments, comment flagging, and post flagging with relative timestamps.",
  "frontend/src/components/PublicPostWarningModal.tsx": "Modal dialog that warns users before making a post public; it cannot be dismissed except via the acknowledgement button.",
  "frontend/src/components/SubscriptionBanner.tsx": "Alert banner shown when a user's subscription has expired, displaying region-specific renewal pricing.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated (or anonymous) ICP backend actor using the current identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Hook that derives authentication state (isAuthenticated, role, userId) from the Internet Identity and exposes a logout function that clears cookies, queries, and navigates to /login.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout flow, delegation validity, and exposing identity and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including auth, user profile, posts, comments, subscriptions, and admin operations using the actor pattern.",
  "frontend/src/index.css": "Global stylesheet importing Lora/Inter fonts, configuring Tailwind with custom CSS variables for light/dark themes, emotion-based color tokens, and utility component classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminPage.tsx": "Admin-only page that guards access by checking authentication and role, redirecting unauthenticated or non-admin users, and rendering the AdminDashboard component.",
  "frontend/src/pages/CommunityFeedPage.tsx": "Authenticated page that displays public posts in chronological order with loading skeletons and empty-state messaging, redirecting unauthenticated or unregistered users.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard for authenticated users showing emotion-based post creation buttons (Confess, Broke, Happy) and a subscription banner when the user's subscription is expired.",
  "frontend/src/pages/LoginPage.tsx": "Login page with email/password form fields that triggers Internet Identity authentication and navigates to the community feed on success.",
  "frontend/src/pages/MyPostsPage.tsx": "Displays the authenticated user's posts in reverse chronological order with loading, empty, and list states. Redirects unauthenticated users to login and users without a profile to signup.",
  "frontend/src/pages/PostCreationPage.tsx": "Post creation page allowing users to select an emotion type, write content (up to 1000 chars), and choose visibility, with rate-limit error handling and entry/public-post warning modals.",
  "frontend/src/pages/SignupPage.tsx": "Registration form collecting display name, email, password, region, and invite code, with field validation, seat capacity display, and backend error mapping.",
  "frontend/src/utils/cookies.ts": "Provides helper functions to set, get, and clear a client-side auth token cookie with Secure and SameSite=Strict attributes and a 7-day expiry.",
  "frontend/src/utils/subscriptionHelpers.ts": "Utility functions to check subscription status (active/grace), determine post creation and public-post permissions, and return regional pricing and status labels.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting URL parameters from both query strings and hash-based routes, persisting them in sessionStorage, and removing sensitive params from the URL hash.",
  "frontend/src/utils/wordCounter.ts": "Exports word-counting helpers including a minimum word count constant (24), a counter function, a minimum-check function, and a function to determine which emotion types require a minimum word count.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH-based color tokens for UI, emotion modes, and status indicators, plus custom fonts, border radii, shadows, and typography/animate/container-queries plugins.",
  "project_state.json": "Tracks the current state of a social platform project including schema version, architectural notes, existing features, and new feature requests. Contains feature IDs, summaries, requirement references, and implementation status for admin dashboard, flagging, and emotional monitoring functionality."
}