{
  "backend/main.mo": "Main Motoko actor defining all persistent state (users, posts, reactions, comments, flags, invite codes, direct messages) and their associated types for the Veil platform, with authorization and invite-link mixins included.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs and titles to their relevant frontend files, component dependencies, and test IDs for build/QA traceability.",
  "frontend-file-summaries.txt": "Auto-generated summaries of every frontend source file, describing each file's purpose, key fixes, and design decisions in one or two sentences.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "Minimal HTML entry point for the Veil app, mounting the React app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes (login, signup, dashboard, post creation, posts, community, admin), wraps the app in QueryClientProvider and ThemeProvider, and redirects the index path to login.",
  "frontend/src/components/AdminAllUsersTab.tsx": "Admin tab component that lists all users with their status badges and provides suspend, unsuspend, cooldown, and remove actions with loading state management per user.",
  "frontend/src/components/AdminCrisisRiskTab.tsx": "Displays crisis-flagged posts for admins with actions to send check-in messages, send crisis resources, or remove posts, using confirmation dialogs and toast notifications.",
  "frontend/src/components/AdminDashboard.tsx": "Main admin dashboard with tabbed navigation covering public posts, users, invite codes, flagged content, emotional alerts, and crisis risks, plus an ecosystem silence banner with a prompt publishing tool.",
  "frontend/src/components/AdminEmotionalAlertsTab.tsx": "Shows a list of users flagged for high-risk emotional activity (3+ 'broke' posts in 3 days), displaying their pseudonym, principal ID, and post count.",
  "frontend/src/components/AdminFlaggedComments.tsx": "Lists flagged comments for admin review with the ability to permanently delete them via a confirmation dialog.",
  "frontend/src/components/AdminFlaggedPosts.tsx": "Displays posts that have been flagged by users, grouped with flag counts, and allows admins to permanently remove them via a confirmation dialog.",
  "frontend/src/components/AdminInviteCodes.tsx": "Admin panel for managing invite codes, supporting generating new codes, copying invite links to clipboard, and revoking unused codes.",
  "frontend/src/components/AdminPublicPostsList.tsx": "Displays a list of all public posts for admins, with sorting by date and the ability to permanently remove individual posts via a confirmation dialog.",
  "frontend/src/components/AdminRoute.tsx": "A route guard component that redirects unauthenticated users to login and shows an access-denied screen for non-admin users, rendering children only for admins.",
  "frontend/src/components/AdminSignup.tsx": "A form that allows an admin to create a new member account by generating an invite code and registering a user with a pseudonym and region.",
  "frontend/src/components/AdminUserManagement.tsx": "Lists all users with their profile info and allows admins to update each user's subscription status via a dropdown select.",
  "frontend/src/components/AdminUserPostHistory.tsx": "Allows admins to search for a user by principal ID and view their post history, with the ability to delete individual posts.",
  "frontend/src/components/EmotionBadge.tsx": "Renders a styled badge pill for a given emotion type (happy, confess, broke) with corresponding colors and labels.",
  "frontend/src/components/EntryProtectionModal.tsx": "A non-dismissible modal shown before writing that informs users about the app's safe-space guidelines and requires explicit acknowledgment to proceed.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying the copyright year and a branded link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "A sticky navigation header with links to Write, Archive, Community, and Admin (role-dependent) pages, plus sign-in/sign-out controls.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with a shared Header, Footer, and a main content area rendered via React Router's Outlet.",
  "frontend/src/components/PostCard.tsx": "Displays a single post with its emotion badge, visibility status, date, and content, and allows the user to toggle the post between private and public visibility.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that shows a loading spinner while auth initializes, then redirects unauthenticated users to /login, otherwise renders children.",
  "frontend/src/components/PublicPostCard.tsx": "Displays a single public post with emotion badge, date, reactions, comments, and flag functionality; non-authors can add text reactions, comments, and flag the post.",
  "frontend/src/components/PublicPostWarningModal.tsx": "A modal dialog that warns users before sharing a post publicly to the community, requiring explicit acknowledgment before proceeding.",
  "frontend/src/components/SubscriptionBanner.tsx": "Displays a subscription expiry banner with region-specific pricing (INR for India, USD otherwise).",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAuth.ts": "Provides authentication state (identity, role, admin status) and a logout function that clears cookies, query cache, and navigates to /login.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profiles, registration, posts, comments, reactions, flags, messages, and admin operations.",
  "frontend/src/index.css": "Defines global styles including Tailwind imports, CSS custom properties for a calm warm-grey design system with light/dark themes and emotion-specific color tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin-only page that redirects unauthenticated users to login and non-admins to community, rendering the AdminDashboard for users with the admin role.",
  "frontend/src/pages/CommunityFeedPage.tsx": "Displays a feed of public posts from all VEIL users, redirecting unauthenticated users to login and showing loading skeletons or error states as needed.",
  "frontend/src/pages/DashboardPage.tsx": "User dashboard showing a welcome message, quick-action cards for creating entries and viewing community, and a preview of the user's three most recent posts.",
  "frontend/src/pages/LoginPage.tsx": "Login page that authenticates users via Internet Identity, redirecting already-authenticated users to the community feed and handling re-login edge cases.",
  "frontend/src/pages/MyPostsPage.tsx": "Displays the authenticated user's personal journal entries split into private and public counts, with loading, error, and empty states.",
  "frontend/src/pages/PostCreationPage.tsx": "Form page for creating a new journal entry with emotion type selection, content input, public/private visibility toggle, word-count validation, and confirmation modals.",
  "frontend/src/pages/SignupPage.tsx": "Invite-only registration page that validates an invite code, collects a pseudonym and region, checks remaining seats, and registers the user via the backend.",
  "frontend/src/utils/cookies.ts": "Utility functions for setting, getting, and clearing a client-side auth token cookie with Secure and SameSite=Strict attributes.",
  "frontend/src/utils/subscriptionHelpers.ts": "Helper functions for checking subscription status (active/grace), determining post creation and public-visibility permissions, and formatting regional pricing and status labels.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/src/utils/wordCounter.ts": "Provides word counting utilities and a 24-word minimum validation, with a helper to determine which emotion types require the minimum word count.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, emotion-mode color tokens, border radii, box shadows, and enabling animate, typography, and container-queries plugins.",
  "project_state.json": "Tracks the overall project state including schema version, feature list, architectural notes, and known issues for a full-stack social/community platform with auth, posting, reactions, comments, admin dashboard, and invite codes."
}