{
  "backend/main.mo": "Main Motoko actor defining data types (User, Post, Reaction, InviteCode), state maps, and backend functions for a pseudonymous social platform called Veil, including invite code management, subscription gating, and authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping two SignupPage.tsx features—anonymous principal guard on form submission and disabling the Create Account button for uninitialized/anonymous principals—to their test IDs and component dependencies.",
  "frontend-file-summaries.txt": "JSON document containing one- to two-sentence summaries of every frontend source file, serving as a reference index for the project's React/TypeScript frontend structure.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, border, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML entry point for the Veil app that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (login, signup, dashboard, create, posts, community, admin) wrapped in a Layout, QueryClientProvider, and Toaster.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component rendering a tabbed interface with sections for public posts, member management, invite codes, post history, and admin signup, with a back-to-dashboard navigation button.",
  "frontend/src/components/AdminInviteCodes.tsx": "Admin panel tab for managing invite codes, supporting adding custom codes, generating random codes, revoking codes, and copying shareable signup links with visual copy-confirmation feedback.",
  "frontend/src/components/AdminPublicPostsList.tsx": "Displays a paginated, sortable list of all public posts for admins, with per-post delete functionality backed by a confirmation dialog.",
  "frontend/src/components/AdminSignup.tsx": "Admin-only form that creates a new user account (bypassing invite codes) by submitting a pseudonym and region selection.",
  "frontend/src/components/AdminUserManagement.tsx": "Lists all users in an accordion UI, allowing admins to suspend/unsuspend accounts and change subscription status per user.",
  "frontend/src/components/AdminUserPostHistory.tsx": "Admin tool that searches for and displays all posts by a given principal ID, with per-post delete capability.",
  "frontend/src/components/EmotionBadge.tsx": "Renders a small styled badge for a given EmotionType (confess, broke, happy) using predefined color configurations.",
  "frontend/src/components/Footer.tsx": "Simple footer component showing the copyright year and a branded link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Sticky top navigation bar with logo, route-aware nav links (including an admin link when applicable), user pseudonym display, and a sign-out button.",
  "frontend/src/components/Layout.tsx": "Wrapper layout component that composes Header, a flex-growing main content area, and Footer into a full-page structure.",
  "frontend/src/components/PostCard.tsx": "Renders a single user-owned post card with support for inline editing, deletion, and toggling public/private visibility, including word count validation and subscription-gated public posting.",
  "frontend/src/components/PublicPostCard.tsx": "Displays a public post with emotion badge, timestamp, reaction count, and reaction buttons (support/care/strength), preventing owners from reacting to their own posts.",
  "frontend/src/components/SubscriptionBanner.tsx": "Shows a warning banner indicating an expired subscription with region-specific pricing details.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profile, subscription status, posts, reactions, and admin operations.",
  "frontend/src/index.css": "Defines global styles, Tailwind base/component/utility layers, CSS custom properties for light/dark themes, and emotion/status color tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Protected admin page that redirects unauthenticated or non-admin users and renders the AdminDashboard component for authorized admins.",
  "frontend/src/pages/CommunityFeedPage.tsx": "Authenticated page that fetches and displays all public posts sorted by creation date, with an empty state if none exist.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page showing a welcome message, subscription banner if expired, and emotion-based buttons to navigate to post creation.",
  "frontend/src/pages/LoginPage.tsx": "Login page that triggers Internet Identity authentication and redirects users to the dashboard or signup based on whether a profile exists.",
  "frontend/src/pages/MyPostsPage.tsx": "Authenticated page listing the current user's posts sorted by date, with empty state and a button to create a new post.",
  "frontend/src/pages/PostCreationPage.tsx": "Post creation page where authenticated users select an emotion type, write content meeting word-count requirements, and submit a new post.",
  "frontend/src/pages/SignupPage.tsx": "Registration page for new authenticated users to choose a pseudonym and region, then create their profile via the register mutation.",
  "frontend/src/utils/subscriptionHelpers.ts": "Provides helper functions for subscription status checks (active/grace), post/public creation permissions, regional pricing display, and status label formatting.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers and hash cleanup to remove sensitive params from the address bar.",
  "frontend/src/utils/wordCounter.ts": "Exports word counting utilities with a minimum word count constant (24) and a helper to determine which emotion types require a minimum word count.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Lora, Inter), OKLCH-based color tokens, border radius, box shadows, and enabling the animate and typography plugins.",
  "project_state.json": "Tracks project state for fixing the signup flow, documenting known issues (invalid principal blob error), completed features (principal guard and button disable in SignupPage.tsx), and a pending backend task to reject anonymous callers in createUser()."
}