{
  "backend/main.mo": "Main actor for the Veil app defining data types (User, Post, Reaction, Comment, Flag, InviteCode) and shared functions for user registration, post creation, reactions, comments, flagging, and admin operations with access control and invite link integration.",
  "backend/migration.mo": "Migration module that transforms old actor state (with fields like userId, reactionCount, editable, subscriptionStartDate) into the new schema (with author, stripped metadata) for users, posts, reactions, and invite codes.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (reactions, comments, flagging, admin dashboard) to their corresponding frontend files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of every frontend source file, describing each component's purpose, key logic, and any notable fixes or alignments with the backend interface.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark themes covering background, foreground, card, border, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML entry point for the Veil app that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (login, signup, dashboard, create, posts, community, admin) wrapped in a shared Layout, QueryClientProvider, and Toaster.",
  "frontend/src/components/AdminDashboard.tsx": "Main admin panel component with tabs for managing posts, users, invite codes, and flagged content. Also displays seat usage stats and a list of ESP-flagged users with a clear action.",
  "frontend/src/components/AdminFlaggedPosts.tsx": "Displays flagged posts grouped by post ID, showing flag counts and reasons, with a confirmation dialog to permanently delete flagged posts.",
  "frontend/src/components/AdminInviteCodes.tsx": "Admin UI for managing invite codes, supporting adding custom codes, generating random ones, revoking them, and copying signup links to clipboard.",
  "frontend/src/components/AdminPublicPostsList.tsx": "Lists all public posts sorted by creation date with emotion badges and visibility labels, allowing admins to delete individual posts via a confirmation dialog.",
  "frontend/src/components/AdminSignup.tsx": "Admin-only form to register a new user account without an invite code, accepting a pseudonym and region selection.",
  "frontend/src/components/AdminUserManagement.tsx": "Admin panel component that lists all users in an accordion, allowing admins to suspend/unsuspend users and change their subscription status.",
  "frontend/src/components/AdminUserPostHistory.tsx": "Admin component that lets admins search for a user's posts by principal ID and delete individual posts with confirmation.",
  "frontend/src/components/EmotionBadge.tsx": "Small presentational component that renders a styled badge for a given EmotionType (confess, broke, happy).",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright year and a branded link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Sticky top navigation header with logo, nav links (including admin link if applicable), user pseudonym display, and sign-out button.",
  "frontend/src/components/Layout.tsx": "Wrapper layout component that composes Header, main content area, and Footer into a full-page flex column.",
  "frontend/src/components/PostCard.tsx": "Displays a single user post with emotion badge, privacy status, word count, and a delete action with confirmation dialog.",
  "frontend/src/components/PublicPostCard.tsx": "Displays a public community post with reaction buttons, collapsible comments section, and a flag-post dialog.",
  "frontend/src/components/SubscriptionBanner.tsx": "Alert banner shown when a user's subscription has expired, displaying region-specific renewal pricing.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated identities, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend data fetching and mutations, covering user profiles, subscription status, posts, reactions, comments, flags, and admin checks.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind CSS, and defines CSS custom properties for light/dark themes including emotion and status color tokens.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin-only page that redirects unauthenticated or non-admin users and renders the AdminDashboard component for authorized admins.",
  "frontend/src/pages/CommunityFeedPage.tsx": "Authenticated page that displays a chronologically sorted list of public community posts, redirecting unauthenticated or unregistered users.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page for authenticated users showing emotion-based post creation buttons and a subscription banner, with navigation guards for unauthenticated or unregistered users.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login page with Internet Identity authentication, redirecting authenticated users to the dashboard or signup page based on whether a profile exists.",
  "frontend/src/pages/MyPostsPage.tsx": "Displays the authenticated user's posts sorted by creation date, with empty state and a button to navigate to post creation.",
  "frontend/src/pages/PostCreationPage.tsx": "Provides a form for creating posts with emotion type selection, content input, privacy toggle, and a 24-word minimum requirement, with ESP modal support for 'broke' posts.",
  "frontend/src/pages/SignupPage.tsx": "Handles new user registration by collecting a pseudonym, region, and invite code, then calling the register mutation and redirecting to the dashboard on success.",
  "frontend/src/utils/subscriptionHelpers.ts": "Provides helper functions to check subscription status (active/grace), determine post/public permissions, and return regional pricing and status labels.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routes, with sessionStorage persistence and hash cleanup helpers.",
  "frontend/src/utils/wordCounter.ts": "Exports utilities to count words in a string, check against a minimum word count (default 24), and determine if an emotion type requires a minimum word count.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH-based semantic colors, serif/sans font families, border radii, box shadows, and enabling dark mode via class.",
  "project_state.json": "Defines the VEIL platform's project state including architecture notes, existing features, known issues, and image requirements for an invite-only emotional reflection MVP built with Next.js, Node.js, JWT, and PostgreSQL."
}