{
  "backend/main.mo": "Main Motoko actor defining all persistent state (users, posts, reactions, comments, flags, messages, invite codes) and core types for the Veil platform, including authorization mixins and invite link module integration.",
  "feature_evidence.json": "Feature evidence report mapping the CommunityFeedPage feed-rendering requirement (no client-side re-sorting, no metrics on cards) to its implementing file and associated components/test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of every frontend source file, describing each file's purpose, key changes, and notable implementation details for build planning reference.",
  "frontend/index.css": "Root Tailwind CSS entry point defining OKLCH-based design token CSS custom properties for light and dark themes, covering background, foreground, card, border, chart, and sidebar color slots.",
  "frontend/index.html": "Minimal HTML shell for the Veil React SPA, mounting the app into a root div and loading the Vite/TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with all application routes (login, signup, dashboard, create, posts, community, admin), wrapping everything in QueryClient, ThemeProvider, and Toaster providers.",
  "frontend/src/components/AdminAllUsersTab.tsx": "Admin tab component that lists all registered users with suspend/unsuspend, cooldown, and permanent-remove actions, displaying subscription status and region badges per user row.",
  "frontend/src/components/AdminCrisisRiskTab.tsx": "Admin tab component for reviewing crisis-risk-flagged posts, providing per-post actions to remove the post, send a custom admin message, or send a hardcoded crisis resource message to the post's author.",
  "frontend/src/components/AdminDashboard.tsx": "Main admin panel component with tabbed navigation covering posts, users, invite codes, flagged content, emotional alerts, and crisis risk. Displays seat usage stats and alert banners for crisis/emotional risk counts.",
  "frontend/src/components/AdminEmotionalAlertsTab.tsx": "Admin tab that lists users flagged for posting 5+ BROKE posts within 3 consecutive days, showing pseudonym, count, and date window. Fetches alert and user data via custom hooks and renders alert cards.",
  "frontend/src/components/AdminFlaggedComments.tsx": "Admin component that displays flagged comments with author pseudonym resolution, relative timestamps, and a confirmation dialog to permanently delete individual comments.",
  "frontend/src/components/AdminFlaggedPosts.tsx": "Admin component that groups flagged posts by post ID, shows report counts, and provides a confirmation dialog to permanently remove posts from the community feed.",
  "frontend/src/components/AdminInviteCodes.tsx": "Admin component for managing invite codes, supporting manual entry, random generation, copy-to-clipboard of signup links, and revocation, with separate lists for unused and used codes.",
  "frontend/src/components/AdminPublicPostsList.tsx": "Displays a paginated, sortable list of all posts for admins with visibility/emotion badges and a confirmation dialog for deleting individual posts.",
  "frontend/src/components/AdminRoute.tsx": "Route guard component that redirects unauthenticated users to login and shows an access-denied screen for non-admin roles.",
  "frontend/src/components/AdminSignup.tsx": "Admin form that auto-generates an invite code and registers a new user account with a pseudonym and region selection.",
  "frontend/src/components/AdminUserManagement.tsx": "Lists all users in an accordion UI, allowing admins to suspend/unsuspend accounts and change subscription status per user.",
  "frontend/src/components/AdminUserPostHistory.tsx": "Lets admins search posts by a user's Principal ID and displays results with options to delete individual posts.",
  "frontend/src/components/EmotionBadge.tsx": "Renders a styled badge pill for a given EmotionType (confess, broke, happy) using predefined color configurations.",
  "frontend/src/components/EntryProtectionModal.tsx": "A non-dismissible modal that presents community guidelines and requires explicit acknowledgment before the user can proceed.",
  "frontend/src/components/Footer.tsx": "Simple site footer displaying the copyright year and a branded link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Sticky navigation header displaying the Veil logo, nav links (including admin if applicable), user pseudonym, and a sign-out button based on authentication state.",
  "frontend/src/components/Layout.tsx": "Simple layout wrapper that composes Header, main content area, and Footer into a full-height flex column.",
  "frontend/src/components/PostCard.tsx": "Displays a single user post with emotion badge, visibility status, content, word count, and controls for toggling visibility or deleting the post with confirmation dialog.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard that redirects unauthenticated users to /login and shows a spinner while authentication state is initializing.",
  "frontend/src/components/PublicPostCard.tsx": "Renders a public community post with text reactions, threaded comments, and flagging functionality for both posts and comments.",
  "frontend/src/components/PublicPostWarningModal.tsx": "Modal dialog that warns users before sharing a post publicly; cannot be dismissed except via the acknowledgment button.",
  "frontend/src/components/SubscriptionBanner.tsx": "Alert banner shown when a user's subscription has expired, displaying region-specific renewal pricing.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Hook that derives authentication state (isAuthenticated, role, userId) from the Internet Identity and provides a logout function that clears cookies, query cache, and navigates to /login.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout flow, delegation validity, and exposing identity and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including auth, user profiles, posts, comments, subscriptions, and admin operations using the ICP actor.",
  "frontend/src/index.css": "Global stylesheet importing Lora/Inter fonts, configuring Tailwind, and defining CSS custom properties for light/dark themes including emotion-specific color tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminPage.tsx": "Admin-only page that guards access by role, redirecting unauthenticated or non-admin users, and renders the AdminDashboard component.",
  "frontend/src/pages/CommunityFeedPage.tsx": "Authenticated page that fetches and displays public posts in chronological order using PublicPostCard components, with loading skeletons and empty state handling.",
  "frontend/src/pages/DashboardPage.tsx": "Authenticated dashboard page showing emotion-selection buttons (Confess, Broke, Happy) to navigate to post creation, with subscription status gating and a banner for expired subscriptions.",
  "frontend/src/pages/LoginPage.tsx": "Login page with an email/password form UI that triggers Internet Identity authentication and redirects to the community feed on success.",
  "frontend/src/pages/MyPostsPage.tsx": "Displays the authenticated user's posts (sorted by date) with public/private counts and visibility legend, redirecting unauthenticated users to login and unregistered users to signup.",
  "frontend/src/pages/PostCreationPage.tsx": "Post creation form supporting three emotion types (confess, broke, happy) with character/word limits, visibility selection (public/private), rate-limit error handling, and entry/public-post warning modals.",
  "frontend/src/pages/SignupPage.tsx": "User registration form collecting display name, email, password, region, and invite code, with seat capacity display, field validation, and backend error mapping.",
  "frontend/src/utils/cookies.ts": "Provides helper functions to set, get, and clear a client-side auth token cookie with Secure and SameSite=Strict attributes and a 7-day expiry.",
  "frontend/src/utils/subscriptionHelpers.ts": "Utility functions to check subscription status (active/grace), determine post creation and public-post permissions, and return region-based pricing and status labels.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting URL parameters from query strings and hash-based routes, persisting them in sessionStorage, and removing sensitive params from the URL hash without reloading.",
  "frontend/src/utils/wordCounter.ts": "Exports word-counting helpers with a 24-word minimum constant, including functions to count words, check the minimum threshold, and determine which emotion types require it.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH-based color tokens (emotion modes, status, semantic UI), serif/sans font families, border radii, box shadows, and typography/animate/container-queries plugins.",
  "project_state.json": "Tracks the project state for 'Veil', a social app whose home feed shows only public posts sorted by createdAt DESC with no ranking, metrics, or engagement signals. Contains existing features, pending architectural requests, and schema/versioning metadata."
}