{
  "backend/main.mo": "Main Motoko actor defining data types (User, Post, Reaction, InviteCode), state maps, and all backend functions for user registration, post creation/editing/deletion, reactions, invite code management, and admin operations.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference for the project's frontend architecture and component responsibilities.",
  "frontend/index.css": "Root CSS file importing Tailwind directives and defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (login, signup, dashboard, create, posts, community, admin) wrapped in a Layout, QueryClientProvider, and Toaster.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component with a tabbed interface for managing public posts, members, invite codes, and post history, with a back-navigation button to the dashboard.",
  "frontend/src/components/AdminInviteCodes.tsx": "Admin invite codes panel that lists unused and used codes, supports adding custom codes, generating random codes, revoking codes, and copying shareable signup links to the clipboard.",
  "frontend/src/components/AdminPublicPostsList.tsx": "Admin component that displays all public posts sorted by newest-first with emotion badges, truncated user IDs, reaction counts, and a confirmation dialog for permanent post deletion.",
  "frontend/src/components/AdminUserManagement.tsx": "Admin component that lists all users in an accordion, allowing admins to suspend/unsuspend users and change their subscription status.",
  "frontend/src/components/AdminUserPostHistory.tsx": "Admin component that searches for posts by principal ID and displays them with the option to delete individual posts.",
  "frontend/src/components/EmotionBadge.tsx": "Small presentational component that renders a styled badge for a given EmotionType (confess, broke, happy).",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying the copyright year and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Sticky header with logo, authenticated navigation links (including admin if applicable), user pseudonym display, and a sign-out button.",
  "frontend/src/components/Layout.tsx": "Wrapper layout component that composes Header, main content area, and Footer into a full-page flex column.",
  "frontend/src/components/PostCard.tsx": "Card component for a user's own post supporting inline editing, deletion, and toggling public/private visibility with subscription gating.",
  "frontend/src/components/PublicPostCard.tsx": "Read-only card for community posts that displays content, emotion badge, and allows authenticated non-owners to add a single reaction.",
  "frontend/src/components/SubscriptionBanner.tsx": "Alert banner shown when a user's subscription is expired, displaying region-specific renewal pricing.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated (or anonymous) backend actor using the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including user profiles, admin status, subscription status, and posts via the actor interface.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind, and defines CSS custom properties for light/dark themes including emotion and status color tokens.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin-only page that redirects unauthenticated or non-admin users and renders the AdminDashboard component for authorized admins.",
  "frontend/src/pages/CommunityFeedPage.tsx": "Authenticated page that displays all public posts sorted by creation date, redirecting unauthenticated or unregistered users.",
  "frontend/src/pages/DashboardPage.tsx": "Main authenticated dashboard where users select an emotion to create a post, with subscription status checks and an expired-subscription banner.",
  "frontend/src/pages/LoginPage.tsx": "Login page that triggers Internet Identity authentication and redirects users to the dashboard or signup flow based on their profile status.",
  "frontend/src/pages/MyPostsPage.tsx": "Displays the authenticated user's posts in reverse chronological order, redirecting to login or signup if unauthenticated or unregistered. Shows a loading spinner, empty state with a link to create a post, or a list of PostCard components.",
  "frontend/src/pages/PostCreationPage.tsx": "Renders the post creation form with emotion type selection, a textarea with live word count, and validation enforcing a 24-word minimum for Confess/Happy emotions. Submits via the createPost mutation and redirects to /posts on success.",
  "frontend/src/pages/SignupPage.tsx": "Invite-only registration form collecting pseudonym, region, and invite code, with pre-fill support from URL/sessionStorage. Redirects unauthenticated users to login and already-registered users to the dashboard.",
  "frontend/src/utils/subscriptionHelpers.ts": "Provides helper functions to check subscription status (active/grace), determine post/public visibility permissions, and return regional pricing and human-readable status labels.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting URL query parameters from both standard and hash-based routing, persisting them to sessionStorage, and cleaning sensitive parameters from the URL without a page reload.",
  "frontend/src/utils/wordCounter.ts": "Exports a 24-word minimum constant and utility functions to count words in a string, check if the minimum is met, and determine whether a given emotion type requires a minimum word count.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom serif/sans fonts, OKLCH-based semantic color tokens (including emotion and status variants), border radius variables, and soft box shadows. Includes the animate and typography plugins.",
  "project_state.json": "Tracks the overall project state for Veil (version 27), documenting the platform summary, architectural decisions, known issues, and a list of existing implemented features with their requirement IDs."
}