{
  "backend/main.mo": "Main ICP actor defining data types (User, Post, Reaction, InviteCode) and backend logic for user registration, post creation/editing, reactions, invite code management, and admin operations with access control and migration support.",
  "backend/migration.mo": "Migration module that seeds five static VEIL invite codes into the actor state on upgrade, preserving existing used/unused state for codes already present.",
  "feature_evidence.json": "Feature evidence report linking the invite-code error surfacing feature (REQ-114) to its implementation files (SignupPage.tsx and useQueries.ts) with high confidence.",
  "frontend-file-summaries.txt": "Pre-generated JSON summaries of all frontend source files describing their purpose, design system, and key behaviors for build planning reference.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark themes covering background, foreground, card, border, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML entry point for the Veil app that mounts the React root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (login, signup, dashboard, create, posts, community, admin) wrapped in QueryClientProvider and a Toaster.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component with four tabs (Public Posts, Members, Invite Codes, Post History) and a back-navigation button to the dashboard.",
  "frontend/src/components/AdminInviteCodes.tsx": "Admin UI for managing invite codes, supporting adding custom codes, generating random codes, revoking codes, and copying invite links with per-code error display.",
  "frontend/src/components/AdminPublicPostsList.tsx": "Displays a paginated, sortable list of all public posts for admins, with the ability to delete individual posts via a confirmation dialog.",
  "frontend/src/components/AdminUserManagement.tsx": "Admin panel component that lists all users in an accordion, allowing admins to suspend/unsuspend users and change their subscription status.",
  "frontend/src/components/AdminUserPostHistory.tsx": "Admin tool that lets admins search for a user by principal ID and view or delete that user's post history.",
  "frontend/src/components/EmotionBadge.tsx": "Renders a styled badge pill for a given EmotionType (confess, broke, happy) with emotion-specific colors and labels.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying the copyright year and a branded link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Sticky top navigation header with logo, nav links (including admin link if applicable), user pseudonym display, and a sign-out button.",
  "frontend/src/components/Layout.tsx": "Wrapper layout component that composes the Header, main content area, and Footer into a full-page flex column.",
  "frontend/src/components/PostCard.tsx": "Card component for a single user post supporting inline editing, deletion, and toggling public/private visibility with subscription-gated publish access.",
  "frontend/src/components/PublicPostCard.tsx": "Renders a single public post card with emotion badge, content, creation date, and reaction buttons (support/care/strength), handling owner and already-reacted disabled states.",
  "frontend/src/components/SubscriptionBanner.tsx": "Displays a warning banner notifying the user their subscription has expired, showing region-specific renewal pricing.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for the backend, covering profile, subscription, post, reaction, invite, and admin operations with canister error extraction utilities.",
  "frontend/src/index.css": "Defines global CSS custom properties for light/dark themes (colors, typography, emotion/status tokens) and reusable Tailwind component classes like veil-card and emotion badges.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin-only page that redirects unauthenticated or non-admin users and renders the AdminDashboard component for authorized admins.",
  "frontend/src/pages/CommunityFeedPage.tsx": "Authenticated page that fetches and displays all public posts sorted by newest first, redirecting unauthenticated or unregistered users.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page that shows emotion-selection buttons (Confess, Broke, Happy) for creating posts, redirects unauthenticated or unregistered users, and displays a subscription banner when the user's subscription is expired.",
  "frontend/src/pages/LoginPage.tsx": "Login page that triggers Internet Identity authentication and redirects users to the dashboard or signup page based on whether they have an existing profile.",
  "frontend/src/pages/MyPostsPage.tsx": "Page that displays the authenticated user's posts sorted by creation date, with an empty state prompt to create the first post.",
  "frontend/src/pages/PostCreationPage.tsx": "Post creation form that lets users select an emotion type and write content, enforcing subscription status and minimum word count requirements before submitting.",
  "frontend/src/pages/SignupPage.tsx": "Registration page where new users enter a pseudonym, region, and invite code to create an account, with error mapping for common backend failure messages.",
  "frontend/src/utils/subscriptionHelpers.ts": "Utility functions for checking subscription status (active/grace/expired), determining post/public permissions, and returning region-based pricing strings.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/src/utils/wordCounter.ts": "Provides word-counting helpers and a 24-word minimum threshold, including a check for which emotion types require the minimum word count.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom fonts (Lora, Inter), OKLCH-based semantic color tokens, border radius variables, and box shadows. Enables dark mode via class and includes the tailwindcss-animate and @tailwindcss/typography plugins.",
  "project_state.json": "Project state document (version 29) describing Veil's architecture, tech stack (React, Node.js/Express, MongoDB, JWT), DB schema, feature list, and known issues including broken pre-seeded invite codes on the deployed app."
}