{
  "backend/main.mo": "Main Motoko actor for the Veil app implementing user registration, post creation/editing/deletion, reactions, invite codes, and admin/access-control logic using mixins and helper modules.",
  "feature_evidence.json": "Feature evidence report confirming that frontend pages and hooks have been wired to the backend, listing the affected files and associated components and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a reference for the project's frontend structure and responsibilities.",
  "frontend/index.css": "Root CSS file importing Tailwind layers and defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point for the Veil React app, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration with all app routes (login, signup, dashboard, post creation, my posts, community, admin) wrapped in a Layout with a Toaster.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component with tabbed navigation for managing public posts, members, invite codes, and post history.",
  "frontend/src/components/AdminInviteCodes.tsx": "Admin UI for viewing, adding, generating, revoking, and copying invite codes, split into active and used code lists.",
  "frontend/src/components/AdminPublicPostsList.tsx": "Displays a sortable list of all public posts for admins, with the ability to delete individual posts via a confirmation dialog.",
  "frontend/src/components/AdminUserManagement.tsx": "Admin panel component for listing all users with options to suspend/unsuspend them and update their subscription status, with expandable user rows.",
  "frontend/src/components/AdminUserPostHistory.tsx": "Admin tool that allows looking up and viewing all posts by a specific user via their Principal ID, with the ability to delete individual posts.",
  "frontend/src/components/EmotionBadge.tsx": "Renders a styled badge for a given emotion type (confess, broke, happy) with configurable size.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright info and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Sticky top navigation header with logo, nav links (My Posts, Community, Admin), user pseudonym display, and sign-out button.",
  "frontend/src/components/Layout.tsx": "Wrapper layout component that composes Header, main content area, and Footer into a full-page flex column.",
  "frontend/src/components/PostCard.tsx": "Card component for displaying a user's post with support for inline editing, deletion, and toggling public/private visibility based on subscription status.",
  "frontend/src/components/PublicPostCard.tsx": "Renders a single public post card with emotion badge, author, date, content, and reaction buttons (support/care/strength), preventing reactions on own posts and handling error toasts.",
  "frontend/src/components/SubscriptionBanner.tsx": "Displays an informational banner notifying the user their grace period has ended, showing region-based pricing and instructions to renew membership.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profile, registration, subscription status, posts, and reactions.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/utilities, CSS custom properties for light/dark themes (colors, emotion types, subscription states), and typography using Lora and Inter fonts.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin-only page that redirects unauthenticated users to login, shows a loading skeleton, and renders AdminDashboard or an access-restricted message based on admin status.",
  "frontend/src/pages/CommunityFeedPage.tsx": "Community feed page that displays public posts sorted newest-first, redirecting unauthenticated or unregistered users, with loading skeletons and an empty state.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page that greets authenticated users and lets them choose an emotion (Confess, Broke, Happy) to create a new post, with subscription status checks and loading skeletons.",
  "frontend/src/pages/LoginPage.tsx": "Login page that handles Internet Identity authentication, redirecting authenticated users to the dashboard or signup page based on whether they have a profile.",
  "frontend/src/pages/MyPostsPage.tsx": "Page displaying the authenticated user's posts sorted newest-first, with loading skeletons and an empty state illustration.",
  "frontend/src/pages/PostCreationPage.tsx": "Post creation form page for a specific emotion type, enforcing minimum word counts for Confess/Happy emotions and subscription status before allowing submission.",
  "frontend/src/pages/SignupPage.tsx": "Registration page where new users enter an invite code, choose a pseudonym, and select a region to create their Veil account.",
  "frontend/src/utils/subscriptionHelpers.ts": "Utility functions for checking subscription permissions (post creation, make-public) and formatting subscription labels and regional pricing strings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/src/utils/wordCounter.ts": "Utility functions for counting words in a string and checking against a minimum word threshold, with a constant for the 24-word minimum requirement.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Lora, Inter), oklch-based color tokens (primary, secondary, emotion states, sidebar, etc.), border radii, shadows, and spacing. Enables dark mode via class, and includes typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state for Veil (version 7), including architecture notes (React/Node/Express/MongoDB/JWT), known issues, and a list of already-implemented features with their requirement IDs and versions."
}