{
  "backend/main.mo": "Main Motoko actor defining all data types (User, Post, Reaction, TextReaction, Comment, Flag, InviteCode) and core backend logic including user registration, post creation, reactions, invite codes, and access control mixins.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features — React Query hooks for text reactions and the emotion-type-specific text reaction UI in PublicPostCard — to their relevant files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated summaries of all frontend source files describing their purpose, key changes, and relationships to the broader app architecture.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom property design tokens for light and dark themes including colors, borders, charts, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app titled 'Veil' that mounts the React root and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component setting up TanStack Router with all app routes, QueryClient provider, ThemeProvider, and a global Toaster notification component.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component with tabbed navigation for managing posts, users, invite codes, and flagged content, plus seat usage display and ESP-flagged user management with clear-flag actions.",
  "frontend/src/components/AdminFlaggedPosts.tsx": "Displays flagged posts grouped by post ID, showing report counts and flag reasons, with a confirmation dialog to permanently delete flagged posts via admin mutations.",
  "frontend/src/components/AdminInviteCodes.tsx": "Admin panel for managing invite codes, supporting adding custom codes, generating random ones, copying signup links, and revoking unused or used codes.",
  "frontend/src/components/AdminPublicPostsList.tsx": "Lists all posts (public and private) sorted by date with emotion badges and visibility labels, allowing admins to delete any post via a confirmation dialog.",
  "frontend/src/components/AdminRoute.tsx": "Route guard component that redirects unauthenticated users to login and shows an access-denied screen for non-admin authenticated users.",
  "frontend/src/components/AdminSignup.tsx": "Admin form to register a new user account by auto-generating an invite code and submitting a pseudonym and region selection.",
  "frontend/src/components/AdminUserManagement.tsx": "Accordion-based admin UI listing all users with controls to suspend/unsuspend accounts and change subscription status per user.",
  "frontend/src/components/AdminUserPostHistory.tsx": "Admin component that lets administrators search for a user's posts by Principal ID and delete individual posts, displaying results in a sorted list with emotion badges and visibility indicators.",
  "frontend/src/components/EmotionBadge.tsx": "Small presentational component that renders a styled badge for one of three emotion types (confess, broke, happy) using predefined color configurations.",
  "frontend/src/components/EntryProtectionModal.tsx": "A non-dismissible dialog modal shown on app entry that requires users to acknowledge Veil's safe-space guidelines before proceeding.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying the copyright year and a branded link to caffeine.ai with the app's hostname as a UTM parameter.",
  "frontend/src/components/Header.tsx": "Sticky top navigation header with logo, role-aware nav links (including an Admin link), the user's pseudonym, and a sign-out button.",
  "frontend/src/components/Layout.tsx": "Wrapper layout component that composes Header, main content area, and Footer into a full-height flex column.",
  "frontend/src/components/PostCard.tsx": "Card component for a user's own post showing emotion badge, visibility status, content, word count, and actions to delete or toggle public/private visibility with rate-limit error handling.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to /login and shows a loading spinner while authentication state is initializing.",
  "frontend/src/components/PublicPostCard.tsx": "Card component for community feed posts supporting emotion-specific text reactions, threaded comments, and a flag/report dialog, with owner-aware interaction restrictions.",
  "frontend/src/components/PublicPostWarningModal.tsx": "A non-dismissible confirmation dialog that warns users their post will be publicly visible before they proceed with sharing.",
  "frontend/src/components/SubscriptionBanner.tsx": "Alert banner displayed when a user's subscription has expired, showing region-specific renewal pricing fetched from a helper utility.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Provides authentication state (isAuthenticated, role, userId) derived from Internet Identity and admin status, along with a logout function that clears cookies, query cache, and redirects to login.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context with an AuthClient, exposing login/clear functions, identity state, and login status via a React context provider and hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile, admin checks, seat info, registration, and posts, each using the actor from useActor.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind, and defines CSS custom properties for light/dark themes including emotion-specific color tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin-only page that redirects unauthenticated or non-admin users and renders the AdminDashboard component for users with the admin role.",
  "frontend/src/pages/CommunityFeedPage.tsx": "Authenticated community feed page that displays public posts in chronological order using PublicPostCard components, with redirects for unauthenticated or unregistered users.",
  "frontend/src/pages/DashboardPage.tsx": "Authenticated dashboard page that displays a welcome message and emotion-selection buttons (Confess, Broke, Happy) for creating posts, with redirects for unauthenticated users and a subscription banner for expired accounts.",
  "frontend/src/pages/LoginPage.tsx": "Login page with email/password form fields and Internet Identity authentication, redirecting to the community feed on success and showing validation/error messages on failure.",
  "frontend/src/pages/MyPostsPage.tsx": "Authenticated page that lists the current user's posts sorted by creation date, with empty-state messaging and a button to navigate to post creation.",
  "frontend/src/pages/PostCreationPage.tsx": "Post creation page allowing authenticated users to write and submit emotion-tagged posts (with public/private visibility), including rate-limit error handling, entry protection, and public post warning modals.",
  "frontend/src/pages/SignupPage.tsx": "Registration page that collects display name, email, password, region, and invite code, validates inputs, and calls the backend register mutation with seat-availability display and error handling.",
  "frontend/src/utils/cookies.ts": "Utility module for managing a client-side auth token cookie with set, get, and clear functions using Secure and SameSite=Strict attributes.",
  "frontend/src/utils/subscriptionHelpers.ts": "Helper functions for evaluating subscription status (active/grace/expired), determining post creation and public-post permissions, and returning region-specific pricing strings and status labels.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and cleaning URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/src/utils/wordCounter.ts": "Provides word counting utilities with a minimum word count threshold (24), including a check for which emotion types ('confess', 'happy') require the minimum.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom fonts, OKLCH-based color tokens for UI and emotion modes (happy/confess/broke), border radii, shadows, and typography/animation plugins.",
  "project_state.json": "Tracks the Veil app's project state including architecture notes, existing features (React Query reaction hooks, emotion-specific text reaction UI), and pending feature requests for a unified reaction system with a backend reactions table."
}