{
  "backend/main.mo": "Main Motoko actor defining all persistent state (users, posts, reactions, comments, flags, messages, invite codes) and core types for the Veil platform, including authorization mixins and capacity/subscription logic.",
  "feature_evidence.json": "Feature evidence report mapping the post visibility display feature (private/public labeling on PostCard and MyPostsPage) to its relevant source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of each frontend source file, describing the purpose and key changes for every component, page, hook, and utility in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design tokens for light and dark themes, including color variables for backgrounds, foregrounds, borders, charts, and sidebar.",
  "frontend/index.html": "Minimal HTML shell for the Veil React app, mounting the root div and loading the main TypeScript module entry point.",
  "frontend/src/App.tsx": "Root React app component setting up TanStack Router with all page routes, React Query client, theme provider, and a global toast notifier.",
  "frontend/src/components/AdminAllUsersTab.tsx": "Admin tab component listing all registered users with controls to suspend/unsuspend, apply a 24-hour cooldown, or permanently remove each user, with confirmation dialogs and toast feedback.",
  "frontend/src/components/AdminCrisisRiskTab.tsx": "Admin tab component displaying posts flagged for crisis risk, with per-post actions to remove the post, send a custom admin message, or send a standardized crisis resource message to the author.",
  "frontend/src/components/AdminDashboard.tsx": "Main admin panel component with tabbed navigation covering posts, users, invite codes, flagged content, emotional alerts, and crisis risk. Displays seat usage stats and alert banners for crisis/emotional monitoring.",
  "frontend/src/components/AdminEmotionalAlertsTab.tsx": "Admin tab that lists users flagged for posting 5+ BROKE posts within 3 consecutive days, showing pseudonym, count, and date window. Purely informational with no automated actions.",
  "frontend/src/components/AdminFlaggedComments.tsx": "Admin component that displays flagged comments with author pseudonym resolution and allows admins to delete them via a confirmation dialog.",
  "frontend/src/components/AdminFlaggedPosts.tsx": "Admin component that groups flagged posts by post ID, shows report counts, and allows admins to permanently remove posts via a confirmation dialog.",
  "frontend/src/components/AdminInviteCodes.tsx": "Admin component for managing invite codes, supporting adding custom codes, generating random ones, copying signup links, and revoking unused or used codes.",
  "frontend/src/components/AdminPublicPostsList.tsx": "Displays a paginated, sortable list of all posts for admins with visibility/emotion badges and per-post delete functionality via a confirmation dialog.",
  "frontend/src/components/AdminRoute.tsx": "Route guard component that redirects unauthenticated users to login and shows an access-denied screen for non-admin roles.",
  "frontend/src/components/AdminSignup.tsx": "Admin form that auto-generates an invite code and registers a new user account with a pseudonym and region selection.",
  "frontend/src/components/AdminUserManagement.tsx": "Lists all users in an accordion UI, allowing admins to suspend/unsuspend accounts and change subscription status per user.",
  "frontend/src/components/AdminUserPostHistory.tsx": "Lets admins search posts by a user's Principal ID and displays results with per-post delete capability.",
  "frontend/src/components/EmotionBadge.tsx": "Renders a styled pill badge for a given EmotionType (confess, broke, happy) using predefined color configurations.",
  "frontend/src/components/EntryProtectionModal.tsx": "A non-dismissible modal that presents community guidelines and requires explicit acknowledgment before proceeding.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying the copyright year and a branded link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Sticky navigation header displaying the Veil logo, nav links (including admin), user pseudonym, and a sign-out button based on authentication state and role.",
  "frontend/src/components/Layout.tsx": "Simple layout wrapper that composes Header, main content area, and Footer into a full-height flex column.",
  "frontend/src/components/PostCard.tsx": "Card component for displaying a user's own post with emotion badge, visibility status, word count, and actions to delete or toggle public/private visibility with rate-limit error handling.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard that redirects unauthenticated users to /login and shows a spinner while the auth state is initializing.",
  "frontend/src/components/PublicPostCard.tsx": "Card for community feed posts supporting text reactions (per-emotion presets), threaded comments, comment flagging, and post flagging with owner-aware UI controls.",
  "frontend/src/components/PublicPostWarningModal.tsx": "Modal dialog that warns users before making a post public; it cannot be dismissed except via the acknowledgement button.",
  "frontend/src/components/SubscriptionBanner.tsx": "Amber warning banner shown when a user's subscription has expired, displaying region-specific renewal pricing.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated (or anonymous) ICP backend actor via React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useAuth.ts": "Hook that derives authentication state (isAuthenticated, userId, role) from the Internet Identity and exposes a logout function that clears cookies, query cache, and navigates to /login.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication using DFINITY's AuthClient, managing login status, identity persistence, and delegation validity across the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including auth, user profiles, posts, comments, reactions, subscriptions, and admin operations using the ICP actor.",
  "frontend/src/index.css": "Global stylesheet importing Lora/Inter fonts, configuring Tailwind, and defining CSS custom properties for light/dark themes including emotion-specific color tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminPage.tsx": "Admin-only page that redirects unauthenticated or non-admin users and renders the AdminDashboard component for authorized admins.",
  "frontend/src/pages/CommunityFeedPage.tsx": "Authenticated page that fetches and displays public posts in chronological order using PublicPostCard components, with redirect logic for unauthenticated users.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page showing emotion-selection buttons (Confess, Broke, Happy) for creating posts, with subscription status gating and a banner for expired subscriptions.",
  "frontend/src/pages/LoginPage.tsx": "Login page with email/password form fields that triggers Internet Identity authentication and redirects to the community feed on success.",
  "frontend/src/pages/MyPostsPage.tsx": "Displays the authenticated user's posts (sorted by date) with public/private counts and visibility legend, redirecting to login or signup if unauthenticated or unregistered.",
  "frontend/src/pages/PostCreationPage.tsx": "Post creation page allowing authenticated users to write and submit posts with emotion type selection, visibility toggle, character/word limits, rate-limit error handling, and entry/public-post warning modals.",
  "frontend/src/pages/SignupPage.tsx": "Registration form collecting display name, email, password, region, and invite code, with validation, seat capacity display, and error handling for backend registration responses.",
  "frontend/src/utils/cookies.ts": "Provides utility functions to set, get, and clear a client-side auth token cookie with Secure and SameSite=Strict attributes and a 7-day expiry.",
  "frontend/src/utils/subscriptionHelpers.ts": "Helper functions to check subscription status (active/grace), determine post creation and public-post permissions, and return regional pricing and status labels.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting URL parameters from query strings and hash-based routes, persisting them in sessionStorage, and removing sensitive parameters from the URL hash.",
  "frontend/src/utils/wordCounter.ts": "Exports functions to count words in a string, check against a minimum word threshold (default 24), and determine which emotion types require a minimum word count.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH-based color tokens (emotion modes, status, semantic UI), custom fonts, border radii, box shadows, and plugins for animation, typography, and container queries.",
  "project_state.json": "Tracks the state of the 'Veil' social platform project, including existing features and pending feature requests around post visibility rules (private vs. public posts), feed filtering, chronological ordering, and removal of resharing controls."
}