{
  "kind": "build_request",
  "title": "Fix RTS blob_of_principal invalid principal crash",
  "projectName": "Veil",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-127",
      "text": "In backend/main.mo, audit every location where a Principal value is used in a blob conversion, equality check, or as a HashMap/TrieMap key. Add a guard using Principal.isAnonymous(caller) at the very top of every public function (register, createPost, editPost, deletePost, setPostPrivacy, addReaction, getMyReaction, getMyProfile, getMyPosts, getMySubscriptionStatus, and all admin functions) so that if the caller is anonymous, the function returns an immediate error result or false rather than proceeding. This prevents the 'RTS error: blob_of_principal: invalid principal' trap that occurs when an anonymous principal is passed to Principal.toBlob or related operations.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "same error \"RTS error: blob_of_principal: invalid principal\""
        ]
      },
      "acceptanceCriteria": [
        "Every public update and query function in main.mo checks Principal.isAnonymous(caller) before performing any Principal-to-blob conversion or HashMap lookup, and returns an error/false immediately if the caller is anonymous.",
        "The 'RTS error: blob_of_principal: invalid principal' trap no longer occurs when an unauthenticated (anonymous) session triggers a backend call.",
        "Authenticated (non-anonymous) callers continue to operate normally — registration, post creation, reactions, and admin functions all work correctly.",
        "The register function specifically rejects anonymous callers with a descriptive error text such as 'Must be authenticated to register'."
      ]
    },
    {
      "id": "REQ-128",
      "text": "In backend/migration.mo, update the postupgrade cleanup step so that when iterating over stored user entries, each Principal key is checked with Principal.isAnonymous before any Principal.toBlob or comparison operation. Any entry whose key is the anonymous principal must be silently removed without trapping. The invite code re-seeding for VEIL-001 through VEIL-005 must also proceed safely after this cleanup.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "same error \"RTS error: blob_of_principal: invalid principal\""
        ]
      },
      "acceptanceCriteria": [
        "The postupgrade hook in migration.mo completes without trapping even if anonymous-principal entries are present in the users stable map.",
        "All user entries keyed to the anonymous principal are removed during postupgrade without crashing.",
        "Invite codes VEIL-001 through VEIL-005 are re-seeded as unused if absent, as before.",
        "No legitimate (non-anonymous) user entries are removed by the cleanup."
      ]
    },
    {
      "id": "REQ-129",
      "text": "In frontend/src/hooks/useQueries.ts, reinforce the existing anonymous-identity guard so that all actor calls check both isAuthenticated from useInternetIdentity and that the identity is not the anonymous identity before dispatching any call to the backend actor. If either check fails, the query must return early with no result and mutations must not be dispatched.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "same error \"RTS error: blob_of_principal: invalid principal\""
        ]
      },
      "acceptanceCriteria": [
        "No backend actor call is ever dispatched when isAuthenticated is false or the identity is the anonymous identity.",
        "All useQuery hooks skip (enabled: false) when the caller is unauthenticated or anonymous.",
        "All useMutation hooks return early without calling the actor when the caller is anonymous.",
        "After a successful Internet Identity login, all queries resume normally and backend calls succeed."
      ]
    }
  ],
  "constraints": [
    "Do not change any file listed under frontend.immutablePaths.",
    "Do not remove or overwrite user entries with valid (non-anonymous) Principal keys during migration cleanup.",
    "Do not wipe invite codes that are already marked as used."
  ],
  "nonGoals": [
    "Changing the visual design or any UI component unrelated to authentication gating.",
    "Adding new backend features beyond the principal-safety guards described above.",
    "Modifying the Internet Identity provider or useInternetIdentity hook."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}