{
  "kind": "build_request",
  "title": "Enforce strict chronological public-only home feed",
  "projectName": "Veil",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "The backend getPublicPosts (or equivalent feed query) must return only posts where visibility is public, sorted strictly by createdAt descending. No ranking score, engagement weight, or any secondary sort criteria may be applied.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Public posts only.",
          "Sorted by createdAt DESC.",
          "No ranking.",
          "No engagement sorting."
        ]
      },
      "acceptanceCriteria": [
        "Only posts with public visibility are returned by the feed query.",
        "Posts are ordered by createdAt descending — newest first.",
        "No ranking algorithm, engagement score, or weighted sort is applied.",
        "Private posts never appear in the feed response."
      ]
    },
    {
      "id": "REQ-2",
      "text": "CommunityFeedPage must render the feed exactly as returned (public posts, createdAt DESC). Remove any client-side re-sorting, ranking, engagement-based filtering, explore sections, or suggested-posts sections. No metrics (like counts, reaction counts, view counts) should be displayed on feed post cards in this page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "No ranking.",
          "No metrics.",
          "No explore.",
          "No suggested posts.",
          "No engagement sorting."
        ]
      },
      "acceptanceCriteria": [
        "CommunityFeedPage displays only public posts in the order they are returned from the backend (createdAt DESC).",
        "No explore section, suggested posts section, or trending section is rendered.",
        "No engagement metrics (reaction counts, comment counts, view counts) are displayed on PublicPostCard within the feed.",
        "No client-side re-sorting or ranking logic is applied to the fetched post list.",
        "The feed contains no UI affordances for filtering, ranking, or discovering posts beyond the plain chronological list."
      ]
    }
  ],
  "constraints": [
    "Do not alter authentication, post creation, or visibility toggle logic.",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Feed ordering must be purely chronological (createdAt DESC) — no secondary sort by any engagement signal."
  ],
  "nonGoals": [
    "Adding explore, discovery, or trending features.",
    "Adding suggested or recommended posts.",
    "Displaying engagement metrics or reaction counts in the feed.",
    "Any form of algorithmic or ranked feed."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}