{
  "kind": "build_request",
  "title": "Fix signup flow to guard against invalid/anonymous principal before account creation",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In SignupPage.tsx, before calling the backend createUser() function, add a guard that checks whether the authenticated identity/principal is available and is not anonymous. If the principal is missing or anonymous, display an error message ('Authentication required. Please log in before creating an account.') and abort the account creation flow entirely.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Account creation happens ONLY after a valid principal exists",
          "if (!principal || principal.isAnonymous()) { showError(\"Authentication required\"); return; }",
          "Only call backend createUser() after identity initialization succeeds."
        ]
      },
      "acceptanceCriteria": [
        "Clicking 'Create Account' while unauthenticated or with an anonymous principal shows an error message and does NOT call the backend createUser().",
        "If the principal is valid and non-anonymous, the signup flow proceeds normally and createUser() is called.",
        "No 'RTS error: blob_of_principal: invalid principal' error occurs when attempting account creation."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In SignupPage.tsx, ensure the Create Account button is disabled (and visually reflects this) when the authenticated identity has not yet fully initialized or when the principal is anonymous. The button should only become enabled once a valid non-anonymous principal is confirmed to be available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "User authentication completes before account creation.",
          "A valid authenticated principal is obtained first.",
          "Prevent anonymous or null principals."
        ]
      },
      "acceptanceCriteria": [
        "The Create Account button is disabled until identity initialization completes and a valid non-anonymous principal is available.",
        "Once authenticated with a valid principal, the button becomes enabled and functional."
      ]
    },
    {
      "id": "REQ-3",
      "text": "In the backend main.mo createUser() function, add a guard at the entry point to validate that caller is not the anonymous principal (Principal.isAnonymous(caller)). If caller is anonymous, return an error variant instead of attempting to convert the principal to blob or create the user record.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Validate the principal before converting it to blob.",
          "Add a guard condition to stop execution if the principal is invalid."
        ]
      },
      "acceptanceCriteria": [
        "Calling createUser() with an anonymous principal returns an error result instead of causing an RTS trap.",
        "No 'blob_of_principal: invalid principal' RTS error is thrown from the backend."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts.",
    "Do not modify files under frontend/src/components/ui.",
    "Do not modify frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Changing the overall authentication mechanism or switching away from Internet Identity.",
    "Redesigning the signup UI beyond adding the principal validation guard and button state.",
    "Adding new user-facing features unrelated to the principal validation fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}