{
  "kind": "build_request",
  "title": "Fix RTS error: blob_of_principal invalid principal",
  "projectName": "Veil",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-124",
      "text": "Audit every location in backend/main.mo where a Principal value is converted to a blob or compared using Principal-related operations (e.g. Principal.toBlob, Principal.fromText, Principal.equal, HashMap keyed by Principal). Ensure that no anonymous principal, empty string, or otherwise invalid principal value is ever passed to these operations. Specifically: (1) In the register function, add a guard at the top that returns an error if caller is the anonymous principal (Principal.isAnonymous(caller)); (2) In every admin guard, reaction handler, post creation handler, and any other function that resolves the caller's user record, check Principal.isAnonymous(caller) before any lookup or blob conversion and return an appropriate error; (3) In the migration/postupgrade hook, skip or remove any user entries whose key principal is anonymous or invalid before iterating over them. This eliminates the 'RTS error: blob_of_principal: invalid principal' crash.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "RTS error: blob_of_principal: invalid principal"
        ]
      },
      "acceptanceCriteria": [
        "Calling any backend function (register, createPost, addReaction, getMyProfile, isAdmin, etc.) from an unauthenticated/anonymous identity no longer causes an RTS trap — it returns a descriptive #err text instead.",
        "The postupgrade/migration hook does not trap when iterating stored user entries that may contain an anonymous principal key.",
        "Authenticated calls from a valid Internet Identity principal continue to work correctly without triggering the blob_of_principal error.",
        "Principal.isAnonymous(caller) guard is present at the entry point of all state-mutating functions (register, createPost, editPost, deletePost, setPostPrivacy, addReaction, adminSuspendUser, adminUnsuspendUser, setSubscriptionStatus).",
        "The canister deploys and upgrades without trapping."
      ]
    },
    {
      "id": "REQ-125",
      "text": "Update backend/migration.mo so that the postupgrade cleanup step safely handles any stored user entries whose Principal key is the anonymous principal or any invalid principal. Before calling Principal.toBlob or any Principal comparison on a stored key, validate the key is non-anonymous. Remove invalid entries without trapping. Re-seed invite codes VEIL-001 through VEIL-005 as unused if absent, as before.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "RTS error: blob_of_principal: invalid principal"
        ]
      },
      "acceptanceCriteria": [
        "The postupgrade hook completes without any RTS trap even if the users stable map contains anonymous-principal entries.",
        "Anonymous-principal user entries are removed during postupgrade.",
        "VEIL-001 through VEIL-005 invite codes are present as unused entries after upgrade.",
        "Legitimate user entries are preserved."
      ]
    },
    {
      "id": "REQ-126",
      "text": "In the frontend, ensure that no backend actor call is made before a valid (non-anonymous) Internet Identity principal is confirmed. In useQueries.ts and any component that calls backend functions, gate all actor calls behind a check that the identity from useInternetIdentity is authenticated (isAuthenticated is true and the identity is not the anonymous identity). If the identity is anonymous or absent, return early or skip the query — do not dispatch the call to the actor.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "RTS error: blob_of_principal: invalid principal"
        ]
      },
      "acceptanceCriteria": [
        "No backend query or mutation is fired when the user is unauthenticated (anonymous identity).",
        "React Query hooks with enabled conditions correctly block execution until isAuthenticated is true.",
        "After successful Internet Identity login, all queries resume normally.",
        "No 'blob_of_principal: invalid principal' error is triggered from the frontend side."
      ]
    }
  ],
  "constraints": [
    "Do not wipe existing legitimate user data from stable state.",
    "Do not change any file under frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts.",
    "All admin guard checks must continue to use the hardcoded admin Principal constant directly."
  ],
  "nonGoals": [
    "Changing the authentication provider or replacing Internet Identity.",
    "Redesigning any UI screens.",
    "Adding new backend features or changing existing function signatures."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}