{
  "kind": "build_request",
  "title": "Wire frontend hooks to complete backend — final integration pass",
  "projectName": "Veil",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-62",
      "text": "Update frontend/src/hooks/useQueries.ts to correctly call all backend functions — createPost, editPost, deletePost, setPostPrivacy, addReaction, getMyReaction, getMyPosts, getPublicPosts, getMyProfile, isAdmin, register, validateInviteCode, and getMySubscriptionStatus — using the actor from useActor. Ensure parameter shapes and return types exactly match the Candid interface generated from backend/main.mo.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "yes, keep going."
        ]
      },
      "acceptanceCriteria": [
        "All query hooks (getMyProfile, getMyPosts, getPublicPosts, isAdmin, getMySubscriptionStatus) return data without errors when the actor is available.",
        "All mutation hooks (createPost, editPost, deletePost, setPostPrivacy, addReaction, register) call the correct backend function with the correct argument types.",
        "getMyReaction accepts a postId string and returns the optional ReactionType.",
        "No TypeScript type errors are present in useQueries.ts.",
        "Each mutation hook invalidates the relevant React Query cache keys on success so the UI reflects updated state without a manual refresh."
      ]
    },
    {
      "id": "REQ-63",
      "text": "Ensure the SignupPage calls the register mutation from useQueries.ts with the correct (inviteCode, pseudonym, region) arguments, handles #ok and #err Result variants from the backend, and routes to the dashboard on success or displays the backend error message on failure.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "Submitting a valid invite code, pseudonym, and region creates a user and navigates to /dashboard.",
        "Submitting an invalid or already-used invite code shows the backend error text inline without a page reload.",
        "Submitting when capacity is reached (100 members) shows the appropriate error message."
      ]
    },
    {
      "id": "REQ-64",
      "text": "Ensure the PostCreationPage calls the createPost mutation with the correct (emotionType, content) arguments, handles the Result returned by the backend, and navigates to the My Posts page on success or shows the error inline on failure.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "A successful createPost call navigates the user to /my-posts.",
        "A backend rejection (expired subscription, word count, suspended) is displayed as an inline error on the form.",
        "The post button remains disabled and shows the word-count prompt when Confess/Happy content is fewer than 24 words."
      ]
    },
    {
      "id": "REQ-65",
      "text": "Ensure PostCard calls the editPost, deletePost, and setPostPrivacy mutations with correct arguments, handles Result variants, and invalidates the 'myPosts' and 'publicPosts' query keys on success so the card list updates immediately.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "Editing a post with reactionCount = 0 updates the card content without a page reload.",
        "Attempting to edit a post with reactionCount > 0 shows the backend error inline.",
        "Toggling a post public shows the confirmation dialog, calls setPostPrivacy(postId, false), and updates the card's status badge on success.",
        "Toggling a post private immediately calls setPostPrivacy(postId, true) and updates the badge.",
        "Deleting a post removes it from the list without a page reload."
      ]
    },
    {
      "id": "REQ-66",
      "text": "Ensure PublicPostCard calls the addReaction mutation and getMyReaction query with correct arguments. Display the user's existing reaction if getMyReaction returns a value. Disable reaction buttons for the post owner and for posts on which the user has already reacted.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "Reacting to a post calls addReaction(postId, reactionType) and invalidates the publicPosts query key.",
        "The user's existing reaction is highlighted/shown when getMyReaction returns a non-null value.",
        "The post owner's reaction buttons are disabled or hidden.",
        "A duplicate reaction attempt shows the backend error message inline without crashing the component."
      ]
    },
    {
      "id": "REQ-67",
      "text": "Ensure all admin functions (adminGetAllPublicPosts, adminGetUserPosts, adminDeletePost, adminSuspendUser, adminUnsuspendUser, adminGetAllUsers, addInviteCode, revokeInviteCode, setSubscriptionStatus) are exposed as query or mutation hooks in useQueries.ts and correctly consumed by the admin dashboard components (AdminPublicPostsList, AdminUserManagement, AdminInviteCodes, AdminUserPostHistory).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "AdminPublicPostsList fetches via adminGetAllPublicPosts and the delete button calls adminDeletePost, refreshing the list on success.",
        "AdminUserManagement fetches via adminGetAllUsers and suspend/unsuspend buttons call adminSuspendUser/adminUnsuspendUser, updating the list on success.",
        "AdminInviteCodes fetches active codes, add calls addInviteCode, and revoke calls revokeInviteCode, all with cache invalidation.",
        "AdminUserPostHistory fetches via adminGetUserPosts with a Principal argument and displays results.",
        "All admin hooks check isAdmin and redirect non-admins before rendering sensitive data."
      ]
    },
    {
      "id": "REQ-68",
      "text": "Ensure the DashboardPage and PostCreationPage read the effective subscription status from the getMySubscriptionStatus query (or getMyProfile) and correctly pass it to the SubscriptionBanner and subscription-gating logic in subscriptionHelpers.ts, so expired users see the calm banner and cannot submit posts or go public.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "Users with #expired subscription see the SubscriptionBanner on the dashboard and post creation page.",
        "The post creation form submit button is blocked with an inline message for expired users.",
        "The 'Go Public' button on PostCard is blocked with an inline message for expired users.",
        "Users with #grace or #active subscription do not see the subscription banner and can post and go public normally."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "All backend function signatures in useQueries.ts must exactly match the Candid interface generated from backend/main.mo — no shape mismatches.",
    "Do not alter the backend/main.mo actor unless a signature fix is strictly required to resolve a type mismatch with the frontend."
  ],
  "nonGoals": [
    "Adding new backend features not already implemented in main.mo.",
    "Changing the visual design or layout of any existing screen.",
    "Implementing real-time updates or WebSocket-based notifications.",
    "Adding email, SMS, or push notification capabilities."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}