{
  "kind": "build_request",
  "title": "VEIL – Private Emotional Infrastructure App (MVP)",
  "projectName": "VEIL",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement invite-only user registration on the backend. Store invite codes in stable state. Enforce a maximum of 100 registered users (seat counter). Registration requires a valid unused invite code, a pseudonym, and a region. On success, mark the invite code as used and create the user record keyed by their authenticated principal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "User Registration (Invite-only)",
          "Seat counter (Max 100 users)"
        ]
      },
      "acceptanceCriteria": [
        "Registration fails with a clear error if no valid invite code is provided",
        "Registration fails once 100 users exist",
        "Invite codes are marked used and cannot be reused",
        "User record is stored with principal, pseudonym, region, and createdAt"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement Internet Identity-based login and session management. On login, validate the authenticated principal is not anonymous, check whether a user profile exists, and route to either the dashboard (existing user) or signup (new user). Guard all protected backend calls so anonymous principals are rejected.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Login / Authentication"
        ]
      },
      "acceptanceCriteria": [
        "Anonymous principals cannot reach any authenticated routes",
        "Existing users land on the dashboard after login",
        "New users are routed to the signup/registration page",
        "Session is restored automatically on page reload"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement emotional post creation with three emotion lanes: Happy, Confess, and Broke. Each post must have a visibility toggle (Public / Private). Posts require a minimum of 24 words. Store posts with fields: postId, authorPrincipal, emotionType, content, visibility, createdAt. Block post creation for unauthenticated or anonymous users.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Create Emotional Posts (Happy / Confess / Broke)",
          "Public & Private Toggle"
        ]
      },
      "acceptanceCriteria": [
        "Posts with fewer than 24 words are rejected",
        "Posts are stored with the correct emotion type (Happy / Confess / Broke)",
        "Visibility can be set to Public or Private at creation time",
        "Anonymous principals cannot create posts"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement witnessing-based reactions on public posts. Supported reaction types: Support, Care, Strength. Reactions are non-metric — display them as witnessing gestures, not counts. A user cannot react to their own post. Each user can only apply each reaction type once per post.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Reactions (Non-metric, witnessing-based)"
        ]
      },
      "acceptanceCriteria": [
        "Reaction buttons show Support, Care, and Strength as witnessing actions",
        "Post owners cannot react to their own posts",
        "Duplicate reactions from the same user on the same post are rejected",
        "Reactions are not displayed as a raw numeric count"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Implement commenting on public posts only. Comments are tied to a postId and authorPrincipal. Private posts must not allow or display comments. Store comments with commentId, postId, authorPrincipal, content, and createdAt.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Commenting (Public posts only)"
        ]
      },
      "acceptanceCriteria": [
        "Comments can only be submitted on public posts",
        "Private posts have no visible comment section",
        "Comments are stored and displayed in chronological order"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Implement a flagging system allowing authenticated users to flag any post for review. Store flags with flagId, postId, reporterPrincipal, reason, and createdAt. Flagged posts should be surfaced in the admin dashboard for review.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Flagging system"
        ]
      },
      "acceptanceCriteria": [
        "Any authenticated user can flag a post",
        "A user cannot flag the same post more than once",
        "Flagged posts appear in the admin dashboard with flag count and reasons"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Implement an admin dashboard accessible only to designated admin principals. The dashboard must include: (1) a list of all public posts with delete capability, (2) member management with suspend/unsuspend and subscription status controls, (3) invite code management (create, revoke, copy), (4) per-user post history with delete capability, (5) flagged posts review queue, (6) current seat count display.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Admin Dashboard"
        ]
      },
      "acceptanceCriteria": [
        "Non-admin users are redirected away from the admin page",
        "Admin can delete any post",
        "Admin can suspend or unsuspend any user",
        "Admin can create and revoke invite codes",
        "Seat counter is visible showing current users vs max 100",
        "Flagged posts are listed with flag details"
      ]
    },
    {
      "id": "REQ-8",
      "text": "Implement Emotional Stability Protocol (ESP) logic. If a user posts in the 'Broke' lane more than 3 times within a 7-day window, automatically flag their account for admin review and display a supportive, non-alarmist message to the user suggesting they take a pause. The protocol must not expose metrics to the user — only surface the supportive message.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Emotional Stability Protocol logic"
        ]
      },
      "acceptanceCriteria": [
        "Posting in Broke more than 3 times in 7 days triggers the protocol",
        "A calm, supportive message is shown to the user when triggered",
        "The user's account is flagged for admin review in the dashboard",
        "No raw counts or metrics are shown to the user"
      ]
    },
    {
      "id": "REQ-9",
      "text": "Build all frontend pages and UI flows for VEIL: Welcome/Landing screen, Login screen (Internet Identity), Signup/Registration screen (invite code + pseudonym + region), Dashboard with emotion-lane navigation buttons (Happy / Confess / Broke), Post Creation page with visibility toggle and word-count validation, My Posts page, Community Feed page (public posts only), and Admin Dashboard page. Apply a calm, minimal visual theme: muted neutral palette, clean typography, no gamification visuals, no bright notification colors, no follower counts, no metric displays.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Clean minimal UI",
          "Calm neutral color palette",
          "No bright notification colors",
          "No gamification visuals"
        ]
      },
      "acceptanceCriteria": [
        "All listed pages are reachable via defined routes",
        "Unauthenticated users are redirected to the login/welcome screen",
        "Emotion lane buttons (Happy / Confess / Broke) are present on the dashboard",
        "Post creation enforces 24-word minimum with live feedback",
        "Public/private toggle is visible and functional on post creation",
        "No numeric follower counts, like counts, or gamification elements are present",
        "Color palette is calm, muted, and neutral throughout"
      ]
    }
  ],
  "constraints": [
    "All backend logic must remain in a single Motoko actor (backend/main.mo)",
    "Authentication must use Internet Identity — no JWT or bcrypt (those are incompatible with this platform)",
    "No PostgreSQL, MongoDB, or external databases — all state lives in Motoko stable variables",
    "No Next.js, Node.js, or Express — frontend is React + TypeScript + Tailwind, backend is Motoko",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "Maximum 100 registered users must be enforced in the backend seat counter",
    "Anonymous principals must be rejected by all authenticated backend functions"
  ],
  "nonGoals": [
    "Real-time features or WebSockets",
    "Email notifications or SMS",
    "External hosting configuration (Vercel, Railway, Supabase)",
    "Third-party auth providers (JWT, bcrypt, Auth0)",
    "Mobile app or React Native version",
    "Paid subscription or Stripe integration in this MVP",
    "Media uploads (images, audio)",
    "Direct messaging between users"
  ],
  "imageRequirements": {
    "required": [
      "Minimal abstract logo mark for VEIL — a thin translucent veil or gauze texture forming a subtle 'V' silhouette on a dark muted background (veil-logo.dim_256x256.png)",
      "Calm dark textured background with very subtle noise grain and muted warm-grey tones, suitable as a full-page app backdrop (veil-bg.dim_1440x900.png)"
    ],
    "edits": []
  }
}