{
  "kind": "build_request",
  "title": "Unified Emotion-Based Text Reaction System",
  "projectName": "Veil",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a `reactions` stable table to the backend with fields: id (Text), postId (Text), userId (Principal), reactionText (Text), createdAt (Int). Enforce one reaction per user per post — if a reaction already exists for that user+post pair, return an error. Expose `addReaction(postId: Text, reactionText: Text)` and `getReactionsForPost(postId: Text)` query functions. Do not expose reaction counts in any public-facing query.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Store reactions table: id, postId, userId, reactionText, createdAt",
          "One reaction per user per post."
        ]
      },
      "acceptanceCriteria": [
        "A user can submit exactly one reaction per post; a second attempt returns an error.",
        "getReactionsForPost returns the list of reaction texts without counts or user identities exposed beyond ownership.",
        "addReaction persists the reaction with a timestamp.",
        "No aggregate count field is returned in any query response."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add React Query hooks `useAddReaction` (mutation) and `usePostReactions` (query) in `frontend/src/hooks/useQueries.ts` wired to the new backend `addReaction` and `getReactionsForPost` functions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Store reactions table"
        ]
      },
      "acceptanceCriteria": [
        "useAddReaction mutation calls backend addReaction and invalidates the post reactions cache on success.",
        "usePostReactions query fetches reactions for a given postId.",
        "Both hooks use the actor from useActor."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Replace the existing emoji reaction UI in `PublicPostCard.tsx` with emotion-type-specific text reaction buttons. No emojis, no counts, no reaction numbers displayed anywhere. Show only the reaction text options as soft-UI buttons. The available reaction texts depend on the post's emotionType: HAPPY → ['I'm smiling with you.', 'This is beautiful.', 'You deserve this.', 'So happy for you.']; CONFESS → ['I see you.', 'That took courage.', 'You're not alone in this.', 'Thank you for sharing this.']; BROKE → ['I'm holding space for you.', 'You don't have to carry this alone.', 'This sounds heavy.', 'Stay. We're here.']. If the current user has already reacted to the post, show their chosen reaction text highlighted softly (no count). Post owners cannot react to their own posts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "No emojis.",
          "No counts displayed.",
          "No reaction numbers shown anywhere.",
          "Reactions depend on emotionType.",
          "No animation stacking.",
          "Soft UI feedback only."
        ]
      },
      "acceptanceCriteria": [
        "HAPPY posts show exactly the 4 HAPPY reaction text options as buttons.",
        "CONFESS posts show exactly the 4 CONFESS reaction text options as buttons.",
        "BROKE posts show exactly the 4 BROKE reaction text options as buttons.",
        "No emoji characters appear in the reaction UI.",
        "No reaction counts or numbers are displayed anywhere on the card.",
        "A user who has already reacted sees their chosen reaction text softly highlighted; the other options are inactive.",
        "Post owners do not see reaction buttons on their own posts.",
        "Clicking a reaction button calls useAddReaction; on success the selected reaction is visually confirmed with soft styling only."
      ]
    }
  ],
  "constraints": [
    "No emoji characters anywhere in the reaction system.",
    "No reaction counts or aggregate numbers exposed in UI or API responses.",
    "One reaction per user per post — enforced at the backend level.",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui."
  ],
  "nonGoals": [
    "Reaction editing or deletion by users.",
    "Displaying which users reacted to a post.",
    "Animated stacking or reaction count badges.",
    "Reactions on private posts."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}