{
  "kind": "build_request",
  "title": "Emotional mode guidance text and tonal UI per mode",
  "projectName": "Veil",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the PostCreationPage, when the user selects the HAPPY emotion mode, display the guidance text: \"Share something real, not something impressive.\" The UI surrounding this guidance and the post creation form should adopt a warm, grounded, quietly celebratory tone — achieved through soft warm color accents (e.g., amber/golden hues), gentle typography weight, and calm spacing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "HAPPY",
          "Share something real, not something impressive.",
          "Tone in UI: Warm, grounded, quiet celebration."
        ]
      },
      "acceptanceCriteria": [
        "Selecting HAPPY mode displays the exact guidance text: \"Share something real, not something impressive.\"",
        "The guidance text area uses warm/golden color accents that visually differentiate it from other modes.",
        "The overall form area conveys a warm, grounded aesthetic when HAPPY is active."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the PostCreationPage, when the user selects the CONFESS emotion mode, display the guidance text: \"This space is for release, not applause.\" The UI should adopt a gentle, human, witnessing tone — soft neutral/muted tones, quiet typography, no bright or celebratory accents.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "CONFESS",
          "This space is for release, not applause.",
          "Tone: Gentle, human, witnessing."
        ]
      },
      "acceptanceCriteria": [
        "Selecting CONFESS mode displays the exact guidance text: \"This space is for release, not applause.\"",
        "The guidance and form area uses muted, gentle color treatment distinct from HAPPY and BROKE modes.",
        "No bright accents; the visual feel is quiet and human."
      ]
    },
    {
      "id": "REQ-3",
      "text": "In the PostCreationPage, when the user selects the BROKE emotion mode, display the guidance text: \"Share what feels true right now. You don't have to explain everything.\" The UI should adopt a tone that is grounded and non-pressuring — subdued, low-contrast color treatment that feels safe and unhurried.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "BROKE",
          "Share what feels true right now. You don't have to explain everything.",
          "Tone"
        ]
      },
      "acceptanceCriteria": [
        "Selecting BROKE mode displays the exact guidance text: \"Share what feels true right now. You don't have to explain everything.\"",
        "The form area uses a subdued, low-contrast color treatment distinct from HAPPY and CONFESS.",
        "The visual tone feels safe and unrushed."
      ]
    },
    {
      "id": "REQ-4",
      "text": "In the PostCreationPage, when the selected emotion mode is BROKE and visibility is set to PUBLIC, automatically display a subtle footer beneath the post creation form with the exact text: \"Veil is a reflection space. If you are in immediate danger, please contact local emergency services.\" This footer must be visually subtle — small font size, muted/low-opacity text color, no bold or alarming styling. It must not appear for BROKE+PRIVATE, or for any other emotion mode regardless of visibility.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "If PUBLIC + BROKE:",
          "Veil is a reflection space. If you are in immediate danger, please contact local emergency services.",
          "This must appear visually subtle."
        ]
      },
      "acceptanceCriteria": [
        "The safety footer appears only when both emotion mode is BROKE and visibility is PUBLIC.",
        "The footer text exactly reads: \"Veil is a reflection space. If you are in immediate danger, please contact local emergency services.\"",
        "The footer uses small font size and muted/low-opacity text — it must not be visually alarming or prominent.",
        "The footer does not appear for BROKE+PRIVATE posts.",
        "The footer does not appear for HAPPY or CONFESS modes regardless of visibility."
      ]
    }
  ],
  "constraints": [
    "Guidance text strings must match exactly as specified: no paraphrasing.",
    "The safety footer text must appear verbatim as specified.",
    "Do not modify immutable frontend paths (hooks, main.tsx, ui components).",
    "All changes are frontend-only; no backend changes required."
  ],
  "nonGoals": [
    "Changing the backend data model or post schema.",
    "Modifying the EmotionBadge component or other shared UI components.",
    "Adding new emotion modes beyond Happy, Confess, and Broke.",
    "Displaying the safety footer anywhere other than the PostCreationPage.",
    "Making the safety footer dismissible or interactive."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}