{
  "kind": "build_request",
  "title": "Fix pre-seeded invite codes not working on deployed app",
  "projectName": "Veil",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-113",
      "text": "Audit and fix the invite code pre-seeding in backend/main.mo. The codes VEIL-001, VEIL-002, VEIL-003, VEIL-004, and VEIL-005 must be present and valid in the InviteCodes stable state immediately after canister deployment or upgrade. Ensure the seeding logic runs in the actor's initialization (or postupgrade hook) so codes are never absent on a fresh deploy. Verify that validateInviteCode returns true for each of these codes before they are used, and that the register function correctly marks them as used upon successful registration.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "The above codes are not working",
          "Pre-seeded invite codes (VEIL-001 through VEIL-005) are not working on the deployed app — invite code validation or seeding may be broken"
        ]
      },
      "acceptanceCriteria": [
        "After a fresh canister deploy or upgrade, validateInviteCode('VEIL-001') through validateInviteCode('VEIL-005') each return true.",
        "Calling register with any of VEIL-001 through VEIL-005 (while unused) successfully creates a user and marks that code as used.",
        "A second registration attempt with the same code returns an #err result indicating the code is already used.",
        "The InviteCodes stable map is populated at actor initialization and survives upgrades via the preupgrade/postupgrade pattern.",
        "If a code has already been seeded (e.g. on upgrade), the seeding logic does not overwrite or duplicate existing codes."
      ]
    },
    {
      "id": "REQ-114",
      "text": "Audit and fix the SignupPage so that invite code validation errors returned by the backend are surfaced clearly to the user. When the backend returns an #err variant from the register call (e.g. 'Invalid invite code', 'Invite code already used', 'Capacity reached'), the exact error text must be displayed inline below the form — not in a modal. The form must remain interactive so the user can correct their input and retry.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "The above codes are not working"
        ]
      },
      "acceptanceCriteria": [
        "When the backend returns #err with text 'Invalid invite code', that text appears inline below the form without a page reload.",
        "When the backend returns #err with text 'Invite code already used', that text appears inline.",
        "When the backend returns #err with text 'Capacity reached', that text appears inline.",
        "The form fields remain editable after an error so the user can retry with a different code.",
        "No modal or alert dialog is used to display the error — only an inline message."
      ]
    }
  ],
  "constraints": [
    "Do not change any files listed in frontend.immutablePaths.",
    "Invite code seeding must use the preupgrade/postupgrade stable var pattern so codes survive canister upgrades.",
    "Do not remove or rename any existing public backend function signatures."
  ],
  "nonGoals": [
    "Adding new invite codes beyond VEIL-001 through VEIL-005 for the pre-seed.",
    "Changing the subscription logic or any other backend functionality.",
    "Modifying any frontend pages other than SignupPage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}