{
  "kind": "build_request",
  "title": "Complete VEIL Platform — Auth, Posts, Emotions, Reactions, Comments, Flagging, Admin, Invites, Seat Counter",
  "projectName": "VEIL",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the full Internet Identity authentication flow is working end-to-end: login via Internet Identity, session persistence, logout, and role detection (admin vs. member). The LoginPage must redirect authenticated users to the community feed, and ProtectedRoute/AdminRoute guards must correctly block unauthenticated or unauthorized access.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Full working authentication flow"
        ]
      },
      "acceptanceCriteria": [
        "Unauthenticated users visiting protected routes are redirected to /login",
        "Non-admin users visiting /admin are shown an access-denied screen",
        "After Internet Identity login, users are redirected to the community feed",
        "Logout clears session state and redirects to login",
        "Auth state (isAuthenticated, userId, role) is correctly exposed via useAuth hook"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure fully functional post creation: users can select an emotion type (happy, confess, broke), write content subject to a 24-word minimum for applicable emotion types, toggle public/private visibility, acknowledge the entry protection modal, acknowledge the public post warning modal when posting publicly, and successfully submit the post to the backend. After submission, redirect the user to their posts list.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Fully functional post creation"
        ]
      },
      "acceptanceCriteria": [
        "Emotion type selector renders all three types (happy, confess, broke) with correct EmotionBadge styling",
        "Word count enforcement prevents submission below 24 words for emotion types that require it",
        "EntryProtectionModal appears on page load and must be acknowledged before composing",
        "PublicPostWarningModal appears when visibility is set to public and must be acknowledged before submit",
        "Successful submission creates the post in the backend and navigates to /my-posts",
        "Post appears on MyPostsPage with correct emotion badge and visibility status"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement emotional mode guidance in the post creation flow: when the user selects the 'broke' emotion type, display contextual guidance text advising them that this mode is for moments of genuine distress and offering a brief grounding prompt. Guidance should be visually distinct (e.g., a highlighted callout) and appear inline without blocking composition.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Emotional mode guidance"
        ]
      },
      "acceptanceCriteria": [
        "Selecting 'broke' emotion type renders a visible guidance callout below the emotion selector",
        "Guidance text does not appear for 'happy' or 'confess' emotion types",
        "Callout is styled distinctly (uses the 'broke' emotion color token) and does not obstruct the content textarea",
        "Guidance does not block form submission"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the reaction system is fully functional on public posts in the community feed: authenticated users (who are not the post's author) can add a text reaction to a post, and reactions are persisted in the backend. Each post card must display the current list of reactions. Users cannot react to their own posts.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Reaction system"
        ]
      },
      "acceptanceCriteria": [
        "Reaction input and submit button are visible on PublicPostCard for non-authors",
        "Reaction input and submit button are hidden for the post's own author",
        "Submitting a reaction calls the backend and optimistically or reactively updates the displayed reaction list",
        "Reactions persist across page refreshes",
        "Reaction count is visible on each post card"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Ensure the comment system is fully functional on public posts: authenticated users (who are not the post's author) can add a comment, comments are persisted in the backend, and the comment list is displayed on each PublicPostCard. Authors cannot comment on their own posts.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Comment system"
        ]
      },
      "acceptanceCriteria": [
        "Comment input and submit button are visible on PublicPostCard for non-authors",
        "Comment input and submit button are hidden for the post's own author",
        "Submitting a comment calls the backend and updates the displayed comment list",
        "Comments persist across page refreshes",
        "Comment count is visible on each post card"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Ensure the flagging system is fully functional on public posts: authenticated users (who are not the post's author) can flag a post for review. Flagged posts must be tracked in the backend with a report count. The flag action should be available on PublicPostCard for non-authors only.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Flagging system"
        ]
      },
      "acceptanceCriteria": [
        "Flag button is visible on PublicPostCard for non-authors",
        "Flag button is hidden for the post's own author",
        "Clicking flag calls the backend and increments the post's report count",
        "Flagged posts with sufficient report count appear in the AdminFlaggedPosts tab",
        "Admins can remove flagged posts from the AdminFlaggedPosts tab",
        "Flagged comments appear in AdminFlaggedComments and can be removed by admins"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Ensure the admin dashboard is fully functional with all tabs operational: Public Posts list (with remove action), User Management (suspend/unsuspend/cooldown/remove), Invite Codes (generate/copy/revoke), Flagged Content (posts and comments with remove actions), Emotional Alerts (users with 5+ 'broke' posts in 3 consecutive days), and Crisis Risk (posts flagged for crisis with check-in and resource actions). The ecosystem silence banner should appear when no public posts exist in the last 5 days, allowing admins to publish a prompt post.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Admin dashboard"
        ]
      },
      "acceptanceCriteria": [
        "All six admin tabs render with correct data fetched from the backend",
        "Remove post action in AdminPublicPostsList permanently deletes the post after confirmation",
        "Suspend, unsuspend, cooldown, and remove actions in AdminAllUsersTab work correctly",
        "Invite code generation creates a new code; revoke removes it; copy link copies to clipboard",
        "AdminFlaggedPosts and AdminFlaggedComments display flagged items and support removal",
        "AdminEmotionalAlertsTab lists users with 5+ broke posts in 3 consecutive days",
        "AdminCrisisRiskTab lists crisis-flagged posts with check-in and resource-send actions",
        "Ecosystem silence banner appears when no public posts in 5 days and allows publishing a prompt"
      ]
    },
    {
      "id": "REQ-8",
      "text": "Ensure invite code logic is fully functional: admins can generate invite codes from the admin dashboard, codes are stored in the backend with used/unused status, and new users can register only by providing a valid unused invite code on the SignupPage. After a code is used during registration, it must be marked as consumed and cannot be reused.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Invite code logic"
        ]
      },
      "acceptanceCriteria": [
        "Admin can generate a new invite code from AdminInviteCodes tab",
        "Generated code appears in the list with copy-link functionality",
        "SignupPage validates the invite code against the backend before allowing registration",
        "Using an invalid or already-used code displays a clear error message",
        "After successful registration with a code, the code is marked used and cannot be reused",
        "Admins can revoke unused codes"
      ]
    },
    {
      "id": "REQ-9",
      "text": "Ensure the seat counter is functional on the SignupPage: display the number of remaining available seats (total capacity minus registered users) so prospective members know availability before registering. Seat count must be fetched live from the backend.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Seat counter"
        ]
      },
      "acceptanceCriteria": [
        "SignupPage displays remaining seat count fetched from the backend",
        "Seat count decrements correctly after each successful registration",
        "If no seats remain, the signup form is disabled with an appropriate message",
        "Seat count reflects the current state on page load"
      ]
    },
    {
      "id": "REQ-10",
      "text": "Wire up all React Query hooks in useQueries.ts to correctly call every corresponding backend Motoko actor method (user registration, login check, post CRUD, reactions, comments, flagging, admin operations, invite code management, seat count). Ensure query keys are consistent, mutations invalidate relevant queries, and error states are surfaced to the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Full working authentication flow",
          "Fully functional post creation",
          "Reaction system",
          "Comment system",
          "Flagging system",
          "Admin dashboard",
          "Invite code logic",
          "Seat counter"
        ]
      },
      "acceptanceCriteria": [
        "Every backend method exposed by the Motoko actor has a corresponding React Query hook in useQueries.ts",
        "Mutations call invalidateQueries on the correct query keys after success",
        "Loading and error states from queries are handled in all consuming components",
        "No stale data is shown after a mutation completes"
      ]
    },
    {
      "id": "REQ-11",
      "text": "Ensure the backend Motoko actor in backend/main.mo implements all required methods fully and correctly: createUser (with invite code validation and seat enforcement), createPost, getPublicPosts, getUserPosts, addReaction, addComment, flagPost, flagComment, getFlags, admin methods (removePost, removeComment, suspendUser, unsuspendUser, applyCooldown, removeUser, updateSubscription, getUserHistory, sendCheckIn, sendCrisisResources, publishPromptPost), invite code methods (generateInviteCode, revokeInviteCode, listInviteCodes), getRemainingSeats, getEmotionalAlerts, and getCrisisRiskPosts. All state must be persisted in stable variables.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Full working authentication flow",
          "Fully functional post creation",
          "Reaction system",
          "Comment system",
          "Flagging system",
          "Admin dashboard",
          "Invite code logic",
          "Seat counter",
          "Database schema",
          "API route definitions"
        ]
      },
      "acceptanceCriteria": [
        "All listed methods exist and are callable from the frontend actor",
        "createUser validates the invite code and rejects registration if seats are full or code is invalid",
        "createPost enforces word count rules on the backend for applicable emotion types",
        "addReaction and addComment reject calls from the post's own author",
        "flagPost and flagComment increment report counts and are retrievable by admins",
        "All admin methods require the caller to have admin role, returning an error otherwise",
        "State is stored in stable variables so it persists across canister upgrades",
        "getRemainingSeats returns total capacity minus current user count"
      ]
    }
  ],
  "constraints": [
    "All backend logic must remain in a single Motoko actor in backend/main.mo",
    "Do not modify files listed in frontend.immutablePaths",
    "Internet Identity is the only supported authentication mechanism — no external auth providers",
    "All state must be stored in Motoko stable variables for upgrade persistence",
    "No external databases, cloud providers, or third-party backend services"
  ],
  "nonGoals": [
    "Real-time WebSocket or push notification features",
    "Email or SMS notification integrations",
    "Payment or subscription billing integration",
    "Mobile app or React Native version",
    "Multi-canister or microservices architecture",
    "External deployment infrastructure (AWS, GCP, Vercel) — ICP deployment only"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}