{
  "kind": "coverage_report",
  "version": "1.0",
  "generatedAt": "2026-03-01T05:13:47.656Z",
  "sources": {
    "buildRequest": true,
    "implementationPlan": true
  },
  "requirements": {
    "total": 3,
    "implemented": 1,
    "items": [
      {
        "id": "REQ-144",
        "summary": "In backend/main.mo, perform a comprehensive audit of every public function and every internal iteration over stored Principal values. Add a Principal.isAnonymous(caller) guard at the absolute top of every public function (register, createPost, editPost, deletePost, setPostPrivacy, addReaction, getMyReaction, getMyProfile, getMyPosts, getMySubscriptionStatus, validateInviteCode, isAdmin, adminGetAllPublicPosts, adminGetUserPosts, adminDeletePost, adminSuspendUser, adminUnsuspendUser, adminGetAllUsers, addInviteCode, revokeInviteCode, setSubscriptionStatus, and adminRegister) so that any call from an anonymous principal returns an immediate safe exit (error result, false, or empty array) before any Principal.toBlob, HashMap lookup, or other Principal operation is attempted. Additionally, audit every iteration over the users, posts, and reactions maps where stored Principal keys or values are passed to Principal.toBlob or Principal.equal — add a defensive isAnonymous check before each such operation and skip/remove any anonymous entry rather than trapping.",
        "status": "unknown",
        "plannedFiles": [],
        "matchedFiles": []
      },
      {
        "id": "REQ-145",
        "summary": "In backend/migration.mo, update the postupgrade cleanup hook so that when iterating over all stored entries in the users map, each Principal key is checked with Principal.isAnonymous before any Principal.toBlob, Principal.equal, or HashMap/TrieMap operation is performed on it. Any entry whose key is the anonymous principal must be silently removed without trapping. After this cleanup, re-seed invite codes VEIL-001 through VEIL-005 as unused entries only if they are absent from the InviteCodes map — never overwriting existing entries.",
        "status": "unknown",
        "plannedFiles": [],
        "matchedFiles": []
      },
      {
        "id": "REQ-146",
        "summary": "In frontend/src/hooks/useQueries.ts, add an additional layer of defense: before dispatching any actor call, verify both (1) isAuthenticated is true from useInternetIdentity, and (2) the identity's principal is not anonymous (identity.getPrincipal().isAnonymous() === false). If either check fails, all query functions must return early with no result and all mutation functions must throw or resolve without dispatching the actor call. This ensures the frontend never sends a request carrying an anonymous principal to the backend.",
        "status": "implemented",
        "plannedFiles": [
          "frontend/src/hooks/useQueries.ts"
        ],
        "matchedFiles": [
          "frontend/src/hooks/useQueries.ts"
        ]
      }
    ]
  },
  "changedFiles": [
    "backend/main.mo",
    "backend/migration.mo",
    "build-request.json",
    "feature_evidence.json",
    "frontend-file-summaries.txt",
    "frontend-implementation-plan.json",
    "frontend/src/hooks/useQueries.ts",
    "project_state.json",
    "scratch/component-selection.json",
    "spec.md",
    "spec_vs_diff_report.json"
  ]
}