{
  "kind": "coverage_report",
  "version": "1.0",
  "generatedAt": "2026-02-28T21:09:17.568Z",
  "sources": {
    "buildRequest": true,
    "implementationPlan": true
  },
  "requirements": {
    "total": 7,
    "implemented": 0,
    "items": [
      {
        "id": "REQ-62",
        "summary": "Update frontend/src/hooks/useQueries.ts to correctly call all backend functions — createPost, editPost, deletePost, setPostPrivacy, addReaction, getMyReaction, getMyPosts, getPublicPosts, getMyProfile, isAdmin, register, validateInviteCode, and getMySubscriptionStatus — using the actor from useActor. Ensure parameter shapes and return types exactly match the Candid interface generated from backend/main.mo.",
        "status": "missing",
        "plannedFiles": [
          "frontend/src/hooks/useQueries.ts"
        ],
        "matchedFiles": []
      },
      {
        "id": "REQ-63",
        "summary": "Ensure the SignupPage calls the register mutation from useQueries.ts with the correct (inviteCode, pseudonym, region) arguments, handles #ok and #err Result variants from the backend, and routes to the dashboard on success or displays the backend error message on failure.",
        "status": "missing",
        "plannedFiles": [
          "frontend/src/pages/SignupPage.tsx"
        ],
        "matchedFiles": []
      },
      {
        "id": "REQ-64",
        "summary": "Ensure the PostCreationPage calls the createPost mutation with the correct (emotionType, content) arguments, handles the Result returned by the backend, and navigates to the My Posts page on success or shows the error inline on failure.",
        "status": "missing",
        "plannedFiles": [
          "frontend/src/pages/PostCreationPage.tsx"
        ],
        "matchedFiles": []
      },
      {
        "id": "REQ-65",
        "summary": "Ensure PostCard calls the editPost, deletePost, and setPostPrivacy mutations with correct arguments, handles Result variants, and invalidates the 'myPosts' and 'publicPosts' query keys on success so the card list updates immediately.",
        "status": "missing",
        "plannedFiles": [
          "frontend/src/components/PostCard.tsx"
        ],
        "matchedFiles": []
      },
      {
        "id": "REQ-66",
        "summary": "Ensure PublicPostCard calls the addReaction mutation and getMyReaction query with correct arguments. Display the user's existing reaction if getMyReaction returns a value. Disable reaction buttons for the post owner and for posts on which the user has already reacted.",
        "status": "missing",
        "plannedFiles": [
          "frontend/src/components/PublicPostCard.tsx"
        ],
        "matchedFiles": []
      },
      {
        "id": "REQ-67",
        "summary": "Ensure all admin functions (adminGetAllPublicPosts, adminGetUserPosts, adminDeletePost, adminSuspendUser, adminUnsuspendUser, adminGetAllUsers, addInviteCode, revokeInviteCode, setSubscriptionStatus) are exposed as query or mutation hooks in useQueries.ts and correctly consumed by the admin dashboard components (AdminPublicPostsList, AdminUserManagement, AdminInviteCodes, AdminUserPostHistory).",
        "status": "missing",
        "plannedFiles": [
          "frontend/src/hooks/useQueries.ts",
          "frontend/src/components/AdminPublicPostsList.tsx",
          "frontend/src/components/AdminUserManagement.tsx",
          "frontend/src/components/AdminInviteCodes.tsx",
          "frontend/src/components/AdminUserPostHistory.tsx"
        ],
        "matchedFiles": []
      },
      {
        "id": "REQ-68",
        "summary": "Ensure the DashboardPage and PostCreationPage read the effective subscription status from the getMySubscriptionStatus query (or getMyProfile) and correctly pass it to the SubscriptionBanner and subscription-gating logic in subscriptionHelpers.ts, so expired users see the calm banner and cannot submit posts or go public.",
        "status": "missing",
        "plannedFiles": [
          "frontend/src/pages/DashboardPage.tsx",
          "frontend/src/pages/PostCreationPage.tsx",
          "frontend/src/components/PostCard.tsx",
          "frontend/src/pages/MyPostsPage.tsx"
        ],
        "matchedFiles": []
      }
    ]
  },
  "changedFiles": [
    "build-request.json",
    "feature_evidence.json",
    "frontend-implementation-plan.json",
    "project_state.json",
    "scratch/component-selection.json",
    "spec.md",
    "spec_vs_diff_report.json"
  ]
}