{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Unified Emotion-Based Text Reaction System",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add React Query hooks for text reactions",
      "acceptanceCriteria": [
        "useAddReaction mutation calls backend addTextReaction and invalidates the post reactions cache on success.",
        "usePostReactions query fetches reactions for a given postId.",
        "Both hooks use the actor from useActor."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useAddTextReaction mutation hook that calls actor.addTextReaction(postId, reactionText) and invalidates ['textReactions', postId] on success. Add useTextReactionsForPost query hook that calls actor.getTextReactionsForPost(postId) with queryKey ['textReactions', postId]. Both hooks depend on actor from useActor and handle loading/error states."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Replace emoji reactions with emotion-type-specific text reaction buttons in PublicPostCard",
      "acceptanceCriteria": [
        "HAPPY posts show exactly the 4 HAPPY reaction text options as buttons.",
        "CONFESS posts show exactly the 4 CONFESS reaction text options as buttons.",
        "BROKE posts show exactly the 4 BROKE reaction text options as buttons.",
        "No emoji characters appear in the reaction UI.",
        "No reaction counts or numbers are displayed anywhere on the card.",
        "A user who has already reacted sees their chosen reaction text softly highlighted; the other options are inactive.",
        "Post owners do not see reaction buttons on their own posts.",
        "Clicking a reaction button calls useAddReaction; on success the selected reaction is visually confirmed with soft styling only."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Replace existing useAddReaction and useReactionsForPost hooks with new implementations. Rename useAddReaction to useAddTextReaction and update it to call actor.addTextReaction(postId, reactionText) instead of addReaction. Rename useReactionsForPost to useTextReactionsForPost and update it to call actor.getTextReactionsForPost(postId) and use queryKey ['textReactions', postId]. Remove old reaction hooks that use ReactionType enum. Ensure both hooks invalidate the correct query keys on mutation success."
        },
        {
          "path": "frontend/src/components/PublicPostCard.tsx",
          "operation": "modify",
          "description": "Remove all emoji-based reaction UI and counts. Replace with emotion-type-specific text reaction buttons. Define reaction text maps: HAPPY → ['I'm smiling with you.', 'This is beautiful.', 'You deserve this.', 'So happy for you.']; CONFESS → ['I see you.', 'That took courage.', 'You're not alone in this.', 'Thank you for sharing this.']; BROKE → ['I'm holding space for you.', 'You don't have to carry this alone.', 'This sounds heavy.', 'Stay. We're here.']. Use useTextReactionsForPost to fetch reactions. Use useAddTextReaction mutation when a button is clicked. Show post owner's buttons only if current user is not the post author (compare userId from useAuth with post.author). If current user has already reacted (check TextReaction.userId matches current user), highlight their chosen text softly with subtle background color and disable other buttons. Do not display any reaction counts or numbers. Use soft UI styling (subtle borders, muted hover states) for reaction buttons. Ensure each button shows only the reaction text with no emoji characters."
        }
      ]
    }
  ]
}