{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enforce post visibility rules (private/public feed access and no resharing)",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Display only public posts in chronological order in CommunityFeedPage and remove all resharing/link-sharing UI elements from PublicPostCard",
      "acceptanceCriteria": [
        "The community feed displays posts in chronological order.",
        "No share, copy link, or reshare button is visible on any post card in the community feed.",
        "Private posts never appear in the community feed UI for any user, including the author."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CommunityFeedPage.tsx",
          "operation": "modify",
          "description": "Verify that the page already fetches only public posts via the getPublicPosts backend capability and displays them chronologically using PublicPostCard components. Confirm that private posts are never rendered in this view. If any filtering or sorting logic needs adjustment to ensure strict chronological ordering, apply it here."
        },
        {
          "path": "frontend/src/components/PublicPostCard.tsx",
          "operation": "modify",
          "description": "Remove or hide any UI elements that allow resharing a post or copying/sharing a post link. This includes removing share buttons, copy link buttons, or reshare options from the card. Ensure the card displays only the post content, emotion badge, text reactions, comments, and flagging functionality. Verify that no social sharing or link generation features remain visible."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Display visibility status (private/public) for user's own posts in MyPostsPage and PostCard, and remove resharing/link-sharing controls",
      "acceptanceCriteria": [
        "Each post card in MyPostsPage shows whether the post is private or public.",
        "Private posts display a label or badge indicating they are visible only to the author.",
        "No share or copy-link button is present on any post card in MyPostsPage."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PostCard.tsx",
          "operation": "modify",
          "description": "Add a visual indicator (badge, label, or icon) that displays the post's visibility status (private or public). For private posts, include descriptive text such as 'Private - Visible only to you' to clearly communicate the visibility scope. Remove any share, copy-link, or reshare buttons if they exist. Ensure the visibility status is prominently displayed alongside the emotion badge and other post metadata."
        },
        {
          "path": "frontend/src/pages/MyPostsPage.tsx",
          "operation": "modify",
          "description": "Verify that PostCard components rendered on this page properly display the visibility status for each post. Ensure that private posts are clearly labeled and that no resharing or link-sharing controls appear. Confirm that the page handles both private and public posts correctly and that the UI communicates the visibility distinction to the user."
        }
      ]
    }
  ]
}