{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix pre-seeded invite codes not working on deployed app",
  "requirements": [
    {
      "id": "REQ-114",
      "summary": "Surface backend invite code validation errors inline on the SignupPage without modals, keeping the form interactive for retry",
      "acceptanceCriteria": [
        "When the backend returns #err with text 'Invalid invite code', that text appears inline below the form without a page reload.",
        "When the backend returns #err with text 'Invite code already used', that text appears inline.",
        "When the backend returns #err with text 'Capacity reached', that text appears inline.",
        "The form fields remain editable after an error so the user can retry with a different code.",
        "No modal or alert dialog is used to display the error — only an inline message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SignupPage.tsx",
          "operation": "modify",
          "description": "Modify the signup form submission handler to catch backend registration errors and display them inline below the form. Add a state variable for error messages and render it as an inline alert (not a modal) below the form fields. Ensure the form remains interactive after an error so users can correct their invite code and retry. The error message should display the exact text returned by the backend (e.g., 'Invalid invite code', 'Invite code already used', 'Capacity reached')."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the register mutation hook to properly surface backend error messages. Ensure that when the backend returns an error variant (e.g., #err from validateInviteCode or register), the mutation's onError callback receives a structured error object containing the backend's error text. This allows the SignupPage to display the exact error message inline without requiring additional parsing."
        }
      ]
    }
  ]
}