{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix signup flow to guard against invalid/anonymous principal before account creation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add principal validation guard before account creation in SignupPage to prevent anonymous or missing principals from calling createUser()",
      "acceptanceCriteria": [
        "Clicking 'Create Account' while unauthenticated or with an anonymous principal shows an error message and does NOT call the backend createUser().",
        "If the principal is valid and non-anonymous, the signup flow proceeds normally and createUser() is called.",
        "No 'RTS error: blob_of_principal: invalid principal' error occurs when attempting account creation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SignupPage.tsx",
          "operation": "modify",
          "description": "Add a principal validation guard at the beginning of the form submission handler. Before calling the backend register() function, check if identity exists and is not anonymous using identity.getPrincipal().isAnonymous(). If the principal is missing or anonymous, display an error message using toast ('Authentication required. Please log in before creating an account.') and return early without calling the backend. Only proceed with account creation if a valid non-anonymous principal is confirmed."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Disable the Create Account button until a valid non-anonymous principal is available",
      "acceptanceCriteria": [
        "The Create Account button is disabled until identity initialization completes and a valid non-anonymous principal is available.",
        "Once authenticated with a valid principal, the button becomes enabled and functional."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SignupPage.tsx",
          "operation": "modify",
          "description": "Add logic to disable the Create Account button when the authenticated identity has not fully initialized or when the principal is anonymous. Compute a boolean that checks whether identity exists and identity.getPrincipal().isAnonymous() is false. Use this boolean to set the button's disabled attribute and apply visual styling (e.g., opacity-50 class) to reflect the disabled state. The button should only be enabled once a valid non-anonymous principal is confirmed."
        }
      ]
    }
  ]
}