{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enforce strict chronological public-only home feed",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Remove all client-side ranking, engagement metrics, and discovery features from CommunityFeedPage to display only chronological public posts",
      "acceptanceCriteria": [
        "CommunityFeedPage displays only public posts in the order they are returned from the backend (createdAt DESC).",
        "No explore section, suggested posts section, or trending section is rendered.",
        "No engagement metrics (reaction counts, comment counts, view counts) are displayed on PublicPostCard within the feed.",
        "No client-side re-sorting or ranking logic is applied to the fetched post list.",
        "The feed contains no UI affordances for filtering, ranking, or discovering posts beyond the plain chronological list."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CommunityFeedPage.tsx",
          "operation": "modify",
          "description": "Remove any client-side sorting, ranking, or filtering logic applied to the fetched public posts array. Ensure the component renders posts exactly as returned by the backend query (getPublicPosts) without re-ordering. Remove any explore, suggested posts, or trending sections from the JSX. Verify that the page displays a simple chronological list of PublicPostCard components with no additional discovery UI."
        },
        {
          "path": "frontend/src/components/PublicPostCard.tsx",
          "operation": "modify",
          "description": "Remove all engagement metric displays (reaction count badges, comment count indicators, view counts) from the card UI when rendered in the community feed context. Keep the text reaction and comment interaction capabilities intact (users can still add reactions and comments), but do not display aggregate counts or engagement statistics. Ensure the card focuses solely on post content, emotion badge, and interaction buttons without numerical feedback."
        }
      ]
    }
  ]
}