{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Dashboard with Moderation Tools and Emotional Monitoring Alerts",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Add 'All Users' tab to AdminDashboard with user management actions (suspend, cooldown, remove)",
      "acceptanceCriteria": [
        "All Users tab renders a list of all users fetched from adminGetAllUsers().",
        "Each row shows pseudonym, region, subscription status, suspended badge (if applicable), and cooldown expiry (if active).",
        "Suspend/Unsuspend button toggles suspended status and invalidates the user list query.",
        "Apply 24-hr Cooldown button calls adminApplyCooldown and shows a success toast.",
        "Permanently Remove User button opens a confirmation dialog; on confirm, calls adminRemoveUser and removes the user from the list.",
        "All mutation buttons are disabled while a request is in-flight."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add a new 'All Users' tab to the existing Tabs component. Include tab trigger and content section that renders the AdminAllUsersTab component (to be created). Wire this tab into the existing tab structure alongside User Management, Invite Codes, Flagged Posts, and Flagged Comments tabs."
        },
        {
          "path": "frontend/src/components/AdminAllUsersTab.tsx",
          "operation": "create",
          "description": "Create AdminAllUsersTab component that fetches all users via useAdminGetAllUsers hook. Display a table or list showing each user's pseudonym, region, subscription status, suspended badge (if suspended is true), and cooldown expiry timestamp (if present). For each user row, include action buttons: Suspend/Unsuspend (using useAdminToggleUserSuspension), Apply 24-hr Cooldown (using useAdminApplyCooldown), and Permanently Remove User (using useAdminRemoveUser with a confirmation dialog). All buttons must be disabled during mutation loading states. Use toast notifications for success/error feedback."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Update AdminFlaggedPosts tab to support 'Remove Post' action with confirmation dialog",
      "acceptanceCriteria": [
        "Flagged Posts tab fetches data from adminGetFlaggedPosts().",
        "Each entry shows post content preview, flag reason, reporter pseudonym (or anonymized ID), and flag timestamp.",
        "A 'Remove Post' button opens a confirmation dialog; on confirm, calls adminRemovePost(postId).",
        "After removal, the flagged post entry disappears from the list and a success toast is shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminFlaggedPosts.tsx",
          "operation": "modify",
          "description": "Add a 'Remove Post' button to each flagged post entry in the existing component. When clicked, open a confirmation dialog (using shadcn/ui AlertDialog). On confirmation, call useAdminRemovePost mutation hook with the postId. After successful removal, invalidate the flagged posts query and display a success toast. Ensure the button is disabled during the mutation loading state."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add 'Emotional Monitoring Alerts' section to AdminDashboard showing users exceeding 5-BROKE-in-3-days threshold",
      "acceptanceCriteria": [
        "A clearly labeled 'Emotional Monitoring Alerts' tab or section is visible only in the AdminDashboard.",
        "Fetches data from adminGetEmotionalAlerts() via a React Query hook.",
        "Each alert card displays: user pseudonym, BROKE post count, and the 3-day window dates.",
        "If no alerts are present, a 'No active alerts' empty state is shown.",
        "No automated action buttons are shown; admin must navigate to All Users tab to act.",
        "Alert cards use a visually distinct soft-warning style (e.g., amber/yellow tone) to indicate concern without alarm."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add a new 'Emotional Monitoring Alerts' tab to the existing Tabs component. Include tab trigger and content section that renders the AdminEmotionalAlertsTab component (to be created). Wire this tab into the existing tab structure."
        },
        {
          "path": "frontend/src/components/AdminEmotionalAlertsTab.tsx",
          "operation": "create",
          "description": "Create AdminEmotionalAlertsTab component that fetches emotional monitoring alerts via useAdminGetEmotionalAlerts hook. Display each alert in a card with amber/yellow soft-warning styling. Show user pseudonym, BROKE post count, and the 3-day date window for each alert. If no alerts exist, render an empty state message ('No active alerts'). Do not include any action buttons; include a note directing admins to the All Users tab for manual intervention."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add admin mutation and query hooks to useQueries.ts for all new backend capabilities",
      "acceptanceCriteria": [
        "All six new hooks are defined in useQueries.ts.",
        "Mutation hooks call invalidateQueries on the relevant query keys after success.",
        "Query hooks use appropriate staleTime and are keyed consistently with existing conventions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add the following React Query hooks following existing patterns: useAdminGetAllUsers (query hook for adminGetAllUsers backend method), useAdminRemoveUser (mutation hook for adminPermanentlyRemoveUser, invalidates 'adminAllUsers' query key on success), useAdminToggleUserSuspension (mutation hook for adminToggleUserSuspension, invalidates 'adminAllUsers' on success), useAdminApplyCooldown (mutation hook for adminApplyPublicPostingCooldown, invalidates 'adminAllUsers' on success), useAdminRemovePost (mutation hook for adminRemovePost, invalidates 'adminFlaggedPosts' and 'adminAllPosts' on success), useAdminGetEmotionalAlerts (query hook for adminGetHighRiskEmotionAlerts backend method), and ensure useAdminGetFlaggedPosts exists (query hook for adminGetFlaggedPosts if not already present). All hooks must use the actor from useActor and handle errors appropriately."
        }
      ]
    }
  ]
}