{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Social platform with public posting, commenting, a flagging system, and an admin dashboard with moderation tools and emotional monitoring alerts.",
  "architectural_notes": [
    "Admin role is required to access the admin dashboard and all moderation actions",
    "Flagging does not notify the post author",
    "Emotional monitoring alert is a soft alert only — no automated messages are sent to users"
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-update-the-admindashboard-frontend-to-include-a-dedicated-all-users-tab-that-lists-every-registered-user-with-their-pseudonym-region-subscription-status-and-suspended-cooldown-state-each-user-row-must-have-action-buttons-suspend-unsuspend-apply-24-hr-cooldown-and-permanently-remove-user-with-a-confirmation-dialog-before-destructive-actions",
      "title": "Update the AdminDashboard frontend to include a dedicated 'All Users' tab that lists every registered user with their pseudonym, region, subscription status, and suspended/cooldown state. Each user row must have action buttons: Suspend/Unsuspend, Apply 24-hr Cooldown, and Permanently Remove User (with a confirmation dialog before destructive actions).",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-admindashboard-frontend-flagged-posts-tab-to-support-a-remove-post-action-on-each-flagged-post-entry-in-addition-to-existing-review-functionality-show-flag-reason-flaggedby-pseudonym-and-createdat-include-a-confirmation-dialog-before-removal",
      "title": "Update the AdminDashboard frontend 'Flagged Posts' tab to support a 'Remove Post' action on each flagged post entry, in addition to existing review functionality. Show flag reason, flaggedBy pseudonym, and createdAt. Include a confirmation dialog before removal.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "feature-add-an-emotional-monitoring-alerts-section-to-the-admindashboard-frontend-this-section-displays-a-list-of-users-who-have-triggered-the-5-broke-in-3-consecutive-days-threshold-each-alert-card-shows-the-user-s-pseudonym-the-number-of-broke-posts-and-the-date-window-no-action-is-taken-automatically-the-admin-can-manually-choose-to-suspend-cooldown-or-remove-the-user-from-the-existing-user-management-controls",
      "title": "Add an 'Emotional Monitoring Alerts' section to the AdminDashboard frontend. This section displays a list of users who have triggered the 5-BROKE-in-3-consecutive-days threshold. Each alert card shows the user's pseudonym, the number of BROKE posts, and the date window. No action is taken automatically; the admin can manually choose to suspend, cooldown, or remove the user from the existing user management controls.",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    },
    {
      "id": "feature-add-all-new-admin-mutation-and-query-hooks-to-usequeries-ts-useadmingetallusers-useadminremoveuser-useadminsuspenduser-useadminapplycooldown-useadminremovepost-useadmingetemotionalalerts-and-useadmingetflaggedposts-if-not-already-present-these-hooks-must-follow-the-existing-react-query-patterns-in-usequeries-ts",
      "title": "Add all new admin mutation and query hooks to useQueries.ts: useAdminGetAllUsers, useAdminRemoveUser, useAdminSuspendUser, useAdminApplyCooldown, useAdminRemovePost, useAdminGetEmotionalAlerts, and useAdminGetFlaggedPosts (if not already present). These hooks must follow the existing React Query patterns in useQueries.ts.",
      "reqIds": [
        "REQ-8"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Flagging system for public posts with reasons (Harmful, Abusive, Unsafe, Other), stored with id/postId/flaggedBy/reason/createdAt/status fields, no author notification",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Admin dashboard (admin role only): view all users, view flagged posts, remove post, suspend user, permanently remove user, apply 24-hour public posting cooldown, generate invite codes",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Emotional Monitoring Alert in admin dashboard: soft alert if a user posts 5 BROKE posts within 3 consecutive days; no auto message, admin manually decides action",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Extend the backend to support admin-only moderation actions: permanently remove a user (delete their account and all associated posts/comments), suspend a user (toggle suspended status), apply a 24-hour public posting cooldown to a specific user, and remove (delete) any post by postId. All these actions must be restricted to callers with the admin role.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Add a backend function to retrieve all registered users (for the admin 'View all users' panel), returning each user's id, pseudonym, region, suspended status, subscription status, and cooldownUntil timestamp. Restrict this to admin callers only.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Add a backend function to retrieve all flagged posts (status = pending) with their associated flag records (id, postId, flaggedBy, reason, createdAt, status). Restrict to admin callers.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Implement the Emotional Monitoring Alert in the backend: track BROKE-emotion post counts per user per day. Expose an admin-only query that returns a list of users who have posted 5 or more BROKE posts within any 3 consecutive calendar days. No automated messages are sent; this is a read-only alert feed for the admin.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    },
    {
      "id": "AR-12",
      "summary": "Generate a migration module (backend/migration.mo) to handle any schema changes introduced by the new user fields (isSuspended, cooldownUntil) and the new flag/alert tracking structures, ensuring existing user records are migrated with safe default values.",
      "reqIds": [
        "REQ-9"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Veil",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}