{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-28T22:45:05.820Z",
  "summary": "The diff only modifies two files: backend/main.mo (truncated) and project_state.json. The backend/main.mo changes appear incomplete and problematic — it uses non-standard Motoko imports (mo:core/* instead of standard base library), references external modules not shown as added files, and the visible portion does not demonstrate all 22 required public functions, stable var/preupgrade/postupgrade pattern, or pre-seeded invite codes. The entire frontend codebase (REQ-105 through REQ-112) shows no changes at all in the diff.",
  "missing_requirements": [
    {
      "id": "REQ-104",
      "requirement": "backend/main.mo must compile correctly with all 22 required public functions, at least 5 pre-seeded invite codes, stable var with preupgrade/postupgrade pattern, and admin Principal protection.",
      "reason": "The visible backend/main.mo uses non-standard imports (mo:core/* instead of mo:base/*), imports external modules (MixinAuthorization, AccessControl, InviteLinksModule) not present in the diff, uses non-standard Map/Text APIs, does not show stable var declarations, no preupgrade/postupgrade hooks, no pre-seeded invite codes, and only a subset of the 22 required functions are visible before truncation. The file appears unlikely to compile.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-105",
      "requirement": "useQueries.ts must have complete, correctly-typed React Query hooks for every backend function with correct cache invalidation.",
      "reason": "No frontend files were modified in the diff. useQueries.ts is not present in any added or modified files.",
      "evidence": []
    },
    {
      "id": "REQ-106",
      "requirement": "LoginPage must call login from useInternetIdentity, redirect to /dashboard or /signup after auth, protect routes, and Header logout must redirect to /login.",
      "reason": "No frontend files were modified in the diff. LoginPage and Header components are not present in any added or modified files.",
      "evidence": []
    },
    {
      "id": "REQ-107",
      "requirement": "SignupPage must read invite code from URL params, pre-fill input, call register mutation, unwrap Result variants, route on success, show inline errors, and offer exactly India and Global region options.",
      "reason": "No frontend files were modified in the diff. SignupPage is not present in any added or modified files.",
      "evidence": []
    },
    {
      "id": "REQ-108",
      "requirement": "DashboardPage must call getMyProfile and getMySubscriptionStatus, pass status to SubscriptionBanner, block /create navigation when expired, and have emotion buttons navigating with query params.",
      "reason": "No frontend files were modified in the diff. DashboardPage is not present in any added or modified files.",
      "evidence": []
    },
    {
      "id": "REQ-109",
      "requirement": "PostCreationPage must read emotion from params, call createPost mutation, enforce 24-word minimum, show live word counter, handle Result, navigate to /posts on success, and show inline errors.",
      "reason": "No frontend files were modified in the diff. PostCreationPage is not present in any added or modified files.",
      "evidence": []
    },
    {
      "id": "REQ-110",
      "requirement": "MyPostsPage and PostCard must use editPost, deletePost, setPostPrivacy mutations with correct cache invalidation, show exact confirmation dialog text, and conditionally show Edit button.",
      "reason": "No frontend files were modified in the diff. MyPostsPage and PostCard components are not present in any added or modified files.",
      "evidence": []
    },
    {
      "id": "REQ-111",
      "requirement": "CommunityFeedPage and PublicPostCard must call getMyReaction, addReaction, disable reaction buttons for owners and already-reacted users, sort newest-first, and show no comments/replies/follower counts.",
      "reason": "No frontend files were modified in the diff. CommunityFeedPage and PublicPostCard are not present in any added or modified files.",
      "evidence": []
    },
    {
      "id": "REQ-112",
      "requirement": "AdminPage and sub-components must wire all admin hooks, redirect non-admins, and have working AdminPublicPostsList, AdminUserManagement, AdminInviteCodes, and AdminUserPostHistory.",
      "reason": "No frontend files were modified in the diff. AdminPage and admin sub-components are not present in any added or modified files.",
      "evidence": []
    }
  ],
  "hallucinated_features": [
    {
      "description": "generateInviteCode, submitRSVP, and getAllRSVPs public functions added to backend",
      "reason": "The backend/main.mo adds these functions which are not among the 22 required functions in REQ-104. submitRSVP and getAllRSVPs relate to RSVP functionality which was never requested.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "description": "External module imports: MixinAuthorization, AccessControl, InviteLinksModule",
      "reason": "The backend imports authorization and invite-links modules from external files not requested and not present in the diff as added files, making the backend likely uncompilable.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "description": "adminPrincipal stored as mutable optional var initialized to null rather than hardcoded",
      "reason": "REQ-104 explicitly requires admin functions to be protected by a hardcoded admin Principal check. The diff declares 'var adminPrincipal : ?Principal = null' which is mutable and starts as null, contradicting the hardcoded requirement.",
      "evidence": [
        "backend/main.mo"
      ]
    }
  ],
  "confidence": 0.88,
  "changed_files": [
    "backend/main.mo",
    "project_state.json"
  ]
}